<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use DateTime;

class RecordSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('records')->insert([
            'user_id' => 1,
            'title' => 'ぴよ将棋レベル40同士対局',
            'first_player_name' => 'Lv40 ピヨ帝(R2610)',
            'second_player_name' => 'Lv40 ピヨ帝(R2610)',
            'first_player_strategy' => 'ゴキゲン中飛車',
            'first_player_castle' => '銀冠',
            'remark' => '5分+5秒ルールでの対局',
            'record' => "
            # ----  ぴよ将棋 棋譜ファイル  ----
棋戦：ぴよ将棋 (5分+5秒)
戦型：▲ゴキゲン中飛車 ▲片美濃 ▲銀冠
開始日時：2024/03/23 16:21:58
終了日時：2024/03/23 16:40:29
手合割：平手
先手：Lv40 ピヨ帝(R2610)
後手：Lv40 ピヨ帝(R2610)
手数----指手---------消費時間--
   1 ７六歩(77)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７六歩   ▲６八銀   
   2 ８四歩(83)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: △３四歩   △８四歩   △４二銀   △３二金   
   3 ５六歩(57)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: ▲２六歩   ▲６八銀   ▲５六歩   ▲７八銀   
*#定跡: ▲７八金   
   4 ８五歩(84)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: △５四歩   △８五歩   
*#定跡: △３四歩   △６二銀   
   5 ７七角(88)   ( 0:01/00:00:03)
*#定跡手
*#推奨定跡: ▲７七角   
   6 ４二玉(51)   ( 0:01/00:00:03)
*#定跡手
*#推奨定跡: △５四歩   
*#定跡: △３四歩   △６二銀   △４二玉   
   7 ５八飛(28)   ( 0:01/00:00:04)
*#▲戦型: ゴキゲン中飛車
*#定跡手
*#定跡: ▲６八銀   ▲５八飛   ▲７八金   ▲２六歩   ▲６六歩   ▲８八飛   
   8 ３二玉(42)   ( 0:01/00:00:04)
*#定跡手
*#定跡: △６二銀   △３二玉   
   9 ４八玉(59)   ( 0:01/00:00:05)
*#定跡手
*#定跡: ▲４八玉   
  10 ６二銀(71)   ( 0:01/00:00:05)
*#定跡手
*#定跡: △１四歩   △６二銀   
  11 ３八玉(48)   ( 0:01/00:00:06)
*#定跡手
*#定跡: ▲３八玉   ▲６八銀   
  12 ７四歩(73)   ( 0:11/00:00:16)
*#定跡: △３四歩   
*#形勢[-35]▲６八銀  △７三銀  ▲５七銀  △６四銀  ▲６六銀  △３四歩  ▲２八玉  △５二金右  ▲１八香  △３三角  ▲１九玉  △２二玉  ▲５五歩  △４四歩  ▲２八銀  △４三金  ▲９六歩  △２四角  
  13 ６八銀(79)   ( 0:11/00:00:17)
*#定跡: ▲６六歩   ▲６八銀   
  14 ６四歩(63)   ( 0:01/00:00:17)
*#定跡手
*#定跡: △６四歩   
*#形勢[16]▲５五歩  △７三桂  ▲６六歩  △１四歩  ▲２八玉  △５二金右  ▲３八銀  △６三銀  ▲９五角  △８三飛  ▲７七角  △８二飛  
  15 ５五歩(56)   ( 0:11/00:00:28)
*#定跡: ▲５七銀   
*#形勢[10]△７三桂  ▲６六歩  △４二銀  ▲２八玉  △３四歩  ▲６七銀  △５二金右  ▲５六銀  △３三銀  ▲７八金  △４四銀  ▲５九飛  △８四飛  ▲９五角  △８二飛  ▲４六歩  △３五銀  ▲６八角  
  16 ７三桂(81)   ( 0:11/00:00:28)
*#形勢[-3]▲６六歩  △５二金右  ▲２八玉  △３四歩  ▲６七銀  △４二銀  ▲５六銀  △３三銀  ▲７八金  △１四歩  ▲５九飛  △４四銀  ▲６八角  △８四飛  ▲９五角  △８三飛  ▲６八角  △８一飛  ▲４六歩  △６五歩  ▲同歩  △パス  
  17 ６六歩(67)   ( 0:11/00:00:39)
*#形勢[24]△１四歩  ▲２八玉  △５二金右  ▲３八銀  △６三銀  ▲９五角  △６二金  ▲５七銀  △９四歩  ▲６八角  △１三角  ▲４六銀  △２二玉  ▲９六歩  △４四歩  ▲７八金  △４二銀  ▲パス  △３四歩  ▲５四歩  
  18 １四歩(13)   ( 0:11/00:00:39)
  19 ７八金(69)   ( 0:01/00:00:40)
*#定跡手
*#定跡: ▲７八金   
*#形勢[7]△６三銀  ▲２八玉  △５二金右  ▲５七銀  △１三角  ▲４六銀  △９四歩  ▲３八銀  △２二玉  ▲１六歩  △４四歩  ▲６八角  △３四歩  ▲１五歩  △同歩  ▲同香  △２四角  ▲１一香成  △同玉  
  20 ６三銀(62)   ( 0:10/00:00:49)
*#定跡: △６五歩   
*#形勢[-12]▲５九飛  △１三角  ▲２八玉  △２二玉  ▲９五角  △６二金  ▲５七銀  △４四歩  ▲１六歩  △２四角  ▲４六銀  △３四歩  ▲６八角  △５二金寄  ▲３八金  △３二銀  ▲パス  △パス  
  21 ５九飛(58)   ( 0:11/00:00:51)
*#形勢[-17]△５二金右  ▲２八玉  △１三角  ▲１六歩  △９四歩  ▲５七銀  △２四角  ▲４六銀  △２二玉  ▲４八金  △６五歩  ▲６九飛  △６四銀  ▲６五歩  △同銀  ▲９六歩  △７六銀  ▲６一飛成  
  22 ５二金(61)   ( 0:10/00:00:59)
*#形勢[4]▲２八玉  △１三角  ▲３八銀  △２二玉  ▲１六歩  △３五角  ▲３六歩  △４四角  ▲６七銀  △１二香  ▲５六銀  △５四歩  ▲９五角  △７二飛  ▲６八角  
  23 ２八玉(38)   ( 0:10/00:01:01)
*#形勢[-11]△１三角  ▲９五角  △７二飛  ▲５七銀  △２二玉  ▲４六銀  △４四歩  ▲６八角  △３二銀  ▲１六歩  △８二飛  ▲９五角  △８三飛  ▲３八銀  △２四角  ▲６八角  △３四歩  ▲５四歩  △同歩  
  24 １三角(22)   ( 0:10/00:01:09)
*#形勢[-20]▲９五角  △７二飛  ▲５七銀  △２二玉  ▲４六銀  △４四歩  ▲６八角  △３二銀  ▲３八金  △３四歩  ▲３六歩  △４三銀  ▲２六歩  △２四角  ▲２七玉  △４二角  
  25 ９五角(77)   ( 0:10/00:01:11)
*#形勢[-45]△８三飛  ▲７七角  △２二玉  ▲１六歩  △８二飛  ▲３八銀  △２四角  ▲２六歩  △６五歩  ▲５七銀  △３二銀  ▲９五角  △６四銀  ▲６五歩  △９四歩  ▲６八角  △６五銀  ▲４六銀  
  26 ８三飛(82)   ( 0:10/00:01:19)
*#形勢[-47]▲７七角  △２二玉  ▲５七銀  △２四角  ▲４六銀  △４四歩  ▲３八銀  △１二香  ▲６八角  △３四歩  ▲２六歩  △８四飛  ▲５八飛  △３三角  
  27 ７七角(95)   ( 0:10/00:01:21)
*#形勢[-62]△２二玉  ▲５七銀  △４四歩  ▲３八銀  △６五歩  ▲６七金  △２四角  ▲５六金  △６四銀  ▲４六歩  △３二銀  ▲１六歩  △４三金  ▲４五歩  △６六歩  ▲同銀  
  28 ２二玉(32)   ( 0:10/00:01:29)
*#形勢[-57]▲５七銀  △３二銀  ▲４六銀  △４四歩  ▲６八角  △３四歩  ▲３八銀  △２四角  ▲３六歩  △４三銀  ▲２六歩  △５一角  ▲１六歩  △６五歩  ▲同歩  △同桂  ▲２七玉  
  29 ５七銀(68)   ( 0:10/00:01:31)
*#形勢[-110]△１二香  ▲１六歩  △２四角  ▲３八銀  △６五歩  ▲４六銀  △７五歩  ▲６八角  △７六歩  ▲３五銀  △１三角  ▲６五歩  △同桂  ▲６六歩打  △３四歩  ▲４六銀  △７七桂  ▲同桂  △同歩成  ▲同角  △２四角  
  30 １二香(11)   ( 0:10/00:01:39)
*#形勢[-64]▲１六歩  △２四角  ▲４六銀  △４四歩  ▲２六歩  △３四歩  ▲２七玉  △３二金  ▲３六歩  △８二飛  ▲３八銀  △１一玉  ▲６八金  △４二角  ▲９六歩  △７二飛  ▲３七銀引  
  31 １六歩(17)   ( 0:10/00:01:41)
*#形勢[-75]△２四角  ▲４六銀  △４四歩  ▲２六歩  △３四歩  ▲２七玉  △１一玉  ▲６八角  △３二金  ▲３八銀  △４三金右  ▲３六歩  △８二飛  ▲２五歩  △３三角  ▲３七銀引  △２二銀  ▲２六銀  
  32 ２四角(13)   ( 0:10/00:01:49)
*#形勢[-114]▲４六銀  △４四歩  ▲３六歩  △３四歩  ▲３七銀  △１一玉  ▲２六銀  △４三金  ▲６八角  △４二角  ▲４八金  △３二金  ▲２五銀  △８二飛  ▲３七桂  △８六歩  ▲同歩  
  33 ４六銀(57)   ( 0:10/00:01:51)
*#形勢[-83]△４四歩  ▲３六歩  △３四歩  ▲２六歩  △１一玉  ▲３七銀  △８二飛  ▲２七玉  △２二銀  ▲３八銀  △４三金  ▲４六歩  △３二金  ▲９六歩  △６五歩  ▲２五歩  △３三角  ▲６八金  
  34 ４四歩(43)   ( 0:10/00:01:59)
*#形勢[-77]▲３六歩  △３四歩  ▲２六歩  △１一玉  ▲３八銀  △２二銀  ▲３七桂  △４三金  ▲２七銀  △５二銀  ▲３八金  △９四歩  ▲６八角  △３三角  ▲２五歩  △４二角  ▲７七桂  △８六歩  ▲８九飛  
  35 ３六歩(37)   ( 0:10/00:02:01)
*#形勢[-101]△３四歩  ▲２六歩  △４三金  ▲３八銀  △１一玉  ▲３七桂  △２二銀  ▲２七銀  △５二銀  ▲３八金  △９四歩  ▲１七香  △４二角  ▲１九飛  △９二香  ▲５九飛  △９五歩  ▲２五歩  
  36 ３四歩(33)   ( 0:10/00:02:09)
*#形勢[-104]▲３八銀  △１一玉  ▲２六歩  △２二銀  ▲３七桂  △４三金  ▲２七銀  △５二銀  ▲３八金  △９四歩  ▲９六歩  △４二角  ▲６八角  △８四飛  ▲２五歩  △８一飛  ▲６七金  △８四飛  
  37 ３八銀(39)   ( 0:10/00:02:11)
*#▲囲い: 片美濃
*
*#形勢[-109]△１一玉  ▲２六歩  △２二銀  ▲３七桂  △４三金  ▲２七銀  △５二銀  ▲３八金  △４二角  ▲２五歩  △９四歩  ▲６八角  △８二飛  ▲２九飛  △９五歩  ▲５九飛  △８四飛  ▲３五歩  △同歩  ▲同銀  △３四歩打  ▲２六銀引  
  38 １一玉(22)   ( 0:10/00:02:19)
*#形勢[-120]▲２六歩  △２二銀  ▲３七桂  △４三金  ▲２七銀  △５二銀  ▲３八金  △４二角  ▲６八角  △９四歩  ▲２九飛  △９五歩  ▲２五歩  △８四飛  ▲５九飛  △８三飛  ▲７七桂  △８六歩  ▲８九飛  
  39 ２六歩(27)   ( 0:10/00:02:21)
*#形勢[-107]△２二銀  ▲３七桂  △４三金  ▲２七銀  △５二銀  ▲３八金  △４二角  ▲６八角  △９四歩  ▲２九飛  △８四飛  ▲５九飛  △９五歩  ▲２五歩  △８三飛  ▲６七金  △８一飛  ▲７七桂  
  40 ２二銀(31)   ( 0:09/00:02:28)
*#形勢[-106]▲３七桂  △４三金  ▲２七銀  △５二銀  ▲３八金  △４二角  ▲７九飛  △９四歩  ▲２九飛  △３三金  ▲５九飛  △３二金引  ▲５四歩  △同歩  ▲同飛  △４三銀  ▲５九飛  △３一金寄  
  41 ３七桂(29)   ( 0:09/00:02:30)
*#形勢[-109]△４三金  ▲６八角  △５二銀  ▲２七銀  △４二角  ▲３八金  △８四飛  ▲２九飛  △８三飛  ▲５九飛  
  42 ４三金(52)   ( 0:09/00:02:37)
*#形勢[-106]▲６八角  △５二銀  ▲２七銀  △９四歩  ▲３八金  △４二角  ▲２五歩  △８一飛  ▲９六歩  △８三飛  ▲２九飛  △８一飛  ▲５九飛  
  43 ６八角(77)   ( 0:09/00:02:39)
*#形勢[-85]△５二銀  ▲２七銀  △９四歩  ▲３八金  △４二角  ▲１八銀  △３三金  ▲２七銀  △３二金引  ▲５四歩  △同歩  ▲同飛  △４三銀  ▲５九飛  △５四歩打  ▲５五歩打  △同歩  ▲同銀  △６五歩  ▲５四歩打  
  44 ５二銀(63)   ( 0:09/00:02:46)
*#形勢[-90]▲２七銀  △９四歩  ▲３八金  △４二角  ▲９六歩  △３二金  ▲２五歩  △３三金寄  ▲５四歩  △同歩  ▲同飛  △４三銀  ▲５九飛  △５四歩打  ▲７七桂  △８六歩  ▲８九飛  
  45 ２七銀(38)   ( 0:09/00:02:48)
*#形勢[-100]△９四歩  ▲３八金  △４二角  ▲６七金  △９五歩  ▲２九飛  △３三金  ▲３五歩  △同歩  ▲２五桂  △４三金  ▲３五銀  △６五歩  ▲３三歩打  △６六歩  ▲同金  △８六歩  ▲同歩  
  46 ９四歩(93)   ( 0:09/00:02:55)
*#形勢[-92]▲３八金  △４二角  ▲１七香  △３一金  ▲２五歩  △３三金  ▲５四歩  △同歩  ▲同飛  △４三銀  ▲５九飛  △５四歩打  ▲７七桂  △８六歩  ▲８九飛  
  47 ３八金(49)   ( 0:09/00:02:57)
*#▲囲い: 銀冠
*
*#形勢[-97]△４二角  ▲９六歩  △３一金  ▲２五歩  △４一銀  ▲３五歩  △３二銀  ▲３四歩  △同金  ▲６七金  △３三金  ▲３五銀  △４三銀  ▲３六歩打  △８二飛  
  48 ４二角(24)   ( 0:09/00:03:04)
*#形勢[-85]▲２五歩  △９五歩  ▲３五歩  △８二飛  ▲６七金  △８四飛  ▲３四歩  △同金  ▲３六歩打  △４三銀  ▲３五銀  △３三金  ▲２六銀引  △３二金引  ▲３五銀  △３三銀  
  49 ２五歩(26)   ( 0:09/00:03:06)
*#形勢[-111]△９五歩  ▲３五歩  △８四飛  ▲１七香  △３五歩  ▲同銀  △３一金  ▲３六歩打  △４一銀  ▲２四歩  △同歩  ▲同銀  △２三歩打  ▲３五銀  △３二銀  
  50 ９五歩(94)   ( 0:09/00:03:13)
*#形勢[-143]▲３五歩  △８四飛  ▲３四歩  △同金  ▲３五銀  △同金  ▲同角  △８六歩  ▲同歩  △同飛  ▲４四角  △４三銀  ▲２六角  △８八歩打  ▲７七桂  △８九歩成  ▲８七歩打  △７六飛  ▲８九飛  
  51 ３五歩(36)   ( 0:09/00:03:15)
*#形勢[-107]△８四飛  ▲３四歩  △同金  ▲３五銀  △同金  ▲同角  △８六歩  ▲同歩  △同飛  ▲５四歩  △同歩  ▲４四角  △５三銀打  ▲３五角  △８八歩打  ▲７七桂  △８九歩成  ▲８七歩打  △７六飛  ▲８九飛  △６六飛  ▲４五桂  △４四歩打  
  52 ８四飛(83)   ( 0:09/00:03:22)
*#形勢[-113]▲３四歩  △同金  ▲３五銀  △同金  ▲同角  △８六歩  ▲同歩  △同飛  ▲５四歩  △同歩  ▲４四角  △５三銀打  ▲１七角  △７六飛  ▲７七歩打  △８六飛  ▲４五桂  △６六飛  ▲６七歩打  △８六飛  
  53 ３四歩(35)   ( 0:09/00:03:24)
*#形勢[-82]△３四金  ▲３五銀  △同金  ▲同角  △８六歩  ▲同歩  △同飛  ▲４四角  △４三銀  ▲３五角  △５八銀打  ▲２九飛  △７六飛  ▲７七金  △７五飛  ▲４六角  △８八歩打  ▲７六歩打  △８五飛  ▲８六歩打  △８二飛  
  54 ３四金(43)   ( 0:09/00:03:31)
*#形勢[-86]▲３五銀  △同金  ▲同角  △８六歩  ▲同歩  △同飛  ▲６八角  △８三飛  ▲３四金打  △４三銀打  ▲３五金  △８八歩打  ▲７七桂  △８九歩成  ▲４六角  △９九と  ▲同飛  
  55 ３五銀(46)   ( 0:09/00:03:33)
*#形勢[-76]△３五金  ▲同角  △４三銀  ▲６八角  △３一金  ▲３六歩打  △８三飛  ▲２六金打  △３二金  ▲２九飛  △４五歩  ▲３五金  △３四銀打  ▲同金  △同銀  ▲２六銀打  
  56 ３五金(34)   ( 0:09/00:03:40)
*#形勢[-86]▲３五角  △４三銀  ▲６八角  △３二金  ▲３六歩打  △３一金  ▲２九飛  △３四歩打  ▲４六角  △８六歩  ▲同歩  △同飛  ▲１五歩  △同歩  ▲７七金打  △４五歩  ▲同桂  △８四飛  
  57 ３五角(68)   ( 0:09/00:03:42)
*#形勢[-99]△８六歩  ▲同歩  △同飛  ▲５四歩  △同歩  ▲４四角  △５三銀打  ▲２六角  △４三銀  ▲７七桂  △７六飛  ▲８九飛  △６六飛  ▲８一飛成  △３一金  ▲６七歩打  △５六飛  ▲９一龍  △５八飛成  
  58 ８六歩(85)   ( 0:09/00:03:49)
*#形勢[-77]▲８六歩  △同飛  ▲５四歩  △同歩  ▲４四角  △５三角  ▲同角成  △同銀  ▲４三角打  △３二銀打  ▲３四角成  △８八歩打  ▲３五馬  △４四角打  ▲６八馬  △７六飛  ▲６七金  △６六飛  
  59 ８六歩(87)   ( 0:09/00:03:51)
*#形勢[-69]△８六飛  ▲５四歩  △同歩  ▲４四角  △５三角  ▲同角成  △同銀  ▲４三角打  △３六歩打  ▲同銀  △２六銀打  ▲３三歩打  △４二銀  ▲３二歩成  △４三銀  ▲４一と  
  60 ８六飛(84)   ( 0:09/00:03:58)
*#形勢[-59]▲５四歩  △同歩  ▲４四角  △５三銀打  ▲２六角  △７六飛  ▲７七桂  △６六飛  ▲３六歩打  △４三銀  ▲６三歩打  △４四歩打  ▲８九飛  
  61 ５四歩(55)   ( 0:09/00:04:00)
*#形勢[-8]△５四歩  ▲４四角  △５三銀打  ▲２六角  △７六飛  ▲７七桂  △６六飛  ▲３六歩打  △４四歩打  ▲８九飛  △８七歩打  ▲４八金打  △８六飛  
  62 ５四歩(53)   ( 0:09/00:04:07)
*#形勢[37]▲４四角  △５三銀打  ▲２六角  △４三銀  ▲７七桂  △４四銀右  ▲３六歩打  △８七歩打  ▲８九飛  △７六飛  ▲８七飛  △８六歩打  ▲８九飛  △６六飛  ▲６七歩打  △５六飛  
  63 ４四角(35)   ( 0:09/00:04:09)
*#形勢[36]△５三角  ▲同角成  △同銀  ▲４三角打  △７六飛  ▲７七歩打  △６六飛  ▲７六金打  △６七角打  ▲６六金  △７八角成  ▲８一飛打  △４二金打  ▲２一角成  △同玉  ▲９一飛成  △パス  
  64 ５三角(42)   ( 0:08/00:04:15)
*#形勢[-21]▲５三角成  △同銀  ▲３三歩打  △７六飛  ▲７七歩打  △６六飛  ▲３二金打  △３三銀  ▲４一金  △３六歩打  ▲４五桂  △３七銀打  ▲同金  △同歩成  ▲同玉  △４四角打  ▲４三金打  
  65 ５三角成(44) ( 0:09/00:04:18)
*#形勢[-27]△５三銀  ▲３三歩打  △３一歩打  ▲４五桂  △５五角打  ▲同飛  △同歩  ▲５三桂  △８九飛成  ▲７九金打  △７八龍  ▲同金  △４二金  ▲３二歩成  △同金  
  66 ５三銀(52)   ( 0:08/00:04:23)
*#形勢[19]▲４三角打  △３六歩打  ▲同銀  △７六飛  ▲７七金打  △７五飛  ▲２四歩  △３五歩打  ▲２三歩成  △同銀  ▲２七銀  △４二歩打  ▲２五角成  △２四歩打  ▲２六馬  
  67 ４三角打     ( 0:08/00:04:26)
*#形勢[13]△７六飛  ▲７七金打  △７五飛  ▲２四歩  △３六歩打  ▲同銀  △３五歩打  ▲２三歩成  △同銀  ▲２七銀  △３六歩  ▲同銀  △３二銀打  ▲２四歩打  △４三銀  
  68 ７六飛(86)   ( 0:08/00:04:31)
*#形勢[-56]▲３四角成  △３六歩打  ▲同銀  △６六飛  ▲２七金打  △３三歩打  ▲３五馬  △４四角打  ▲同馬  △同銀  ▲６三角打  △３一金  ▲５四角成  △３五銀打  ▲同銀  △同銀  ▲３二歩打  △４一金  
  69 ３四角成(43) ( 0:08/00:04:34)
*#形勢[-16]△３六歩打  ▲同銀  △３五歩打  ▲２七銀  △３六銀打  ▲２四歩  △３二金  ▲２六金打  △２七銀成  ▲同金引  △３六銀打  ▲２六金  △３七銀成  ▲同玉  △６六飛  
  70 ３六歩打     ( 0:08/00:04:39)
*#形勢[14]▲３六銀  △６六飛  ▲２七金打  △３二銀打  ▲３五馬  △４四角打  ▲４五馬  △６五飛  ▲５五歩打  △同飛  ▲同馬  △同角  ▲７七桂  △３五歩打  ▲同銀  △６六角  
  71 ３六銀(27)   ( 0:08/00:04:42)
*#形勢[-28]△６六飛  ▲２七金打  △６八角打  ▲同金  △同飛成  ▲７七角打  △５九龍  ▲同角  △６九飛打  ▲７七角  △３三歩打  ▲２四歩  △３二銀打  ▲７八馬  △４九飛成  
  72 ６六飛(76)   ( 0:08/00:04:47)
*#形勢[58]▲２七金打  △６八角打  ▲同金  △同飛成  ▲７七角打  △５九龍  ▲同角  △６九飛打  ▲７七角  △３三歩打  ▲２四歩  △３二金  ▲２三歩成  
  73 ２七金打     ( 0:08/00:04:50)
*#形勢[140]△６九角打  ▲３三歩打  △同銀  ▲６七金  △３四銀  ▲６六金  △７八角成  ▲７一飛打  △６八馬  ▲４一飛成  △５九馬  ▲３二金打  △６八飛打  ▲２一龍  
  74 ６九角打     ( 0:08/00:04:55)
*#形勢[367]▲７九金  △８七角成  ▲２四歩  △３二銀打  ▲３三歩打  △同桂  ▲６七歩打  △８六飛  ▲３五馬  △４二銀  ▲３四歩打  △８八歩打  ▲３三歩成  △同銀右  ▲３四桂打  
  75 ７九金(78)   ( 0:08/00:04:58)
*#形勢[388]△８七角成  ▲２四歩  △３三歩打  ▲３五馬  △４二銀  ▲２三歩成  △同銀  ▲２二歩打  △同玉  ▲２四歩打  △３二銀  ▲３四歩打  △８八歩打  ▲３三歩成  △同銀右  ▲３四歩打  △同銀  
  76 ８七角成(69) ( 0:08/00:05:03)
*#形勢[311]▲２四歩  △３三歩打  ▲３五馬  △４二銀  ▲２三歩成  △同銀  ▲２二歩打  △同玉  ▲２四歩打  △３二銀  ▲３四歩打  △４三銀打  ▲２五銀  △６七飛成  
  77 ２四歩(25)   ( 0:08/00:05:06)
*#形勢[480]△３三歩打  ▲３五馬  △４二銀  ▲２三歩成  △同銀  ▲２四歩打  △３二銀  ▲１五歩  △２二歩打  ▲１四歩  △１八歩打  ▲同香  △６七飛成  
  78 ３三歩打     ( 0:08/00:05:11)
*#形勢[480]▲３五馬  △４二銀  ▲２三歩成  △同銀  ▲２四歩打  △３二銀  ▲１五歩  △８八歩打  ▲１四歩  △１八歩打  ▲同香  △２六歩打  ▲同金  △８九歩成  ▲同金  △６七飛成  
  79 ３五馬(34)   ( 0:08/00:05:14)
*#形勢[566]△４四銀打  ▲２三歩成  △同銀  ▲２四歩打  △３二銀  ▲５七馬  △８六飛  ▲６八馬  △６五桂  ▲８八歩打  △７六馬  ▲６六歩打  △４八歩打  ▲８六馬  △同馬  ▲２九飛  
  80 ４四銀打     ( 0:08/00:05:19)
*#形勢[526]▲２三歩成  △同銀  ▲５七馬  △８六飛  ▲２四歩打  △３二銀  ▲６七馬  △２二玉  ▲５六飛  △８二飛  ▲７八金  △５五歩  ▲６六飛  △５四馬  ▲８三歩打  △同飛  ▲７九金  △パス  
  81 ２三歩成(24) ( 0:08/00:05:22)
*#形勢[699]△２三銀  ▲５七馬  △６五馬  ▲２四歩打  △３二銀  ▲５二歩打  △２二歩打  ▲１五歩  △同歩  ▲１三歩打  △同香  ▲２五桂  △５五馬  ▲３七歩打  △６五桂  ▲６六馬  △同馬  ▲１三桂成  △同桂  
  82 ２三銀(22)   ( 0:08/00:05:27)
*#形勢[581]▲５七馬  △８六飛  ▲２四歩打  △３二銀  ▲１五歩  △同歩  ▲１三歩打  △同香  ▲２五桂  △１四香  ▲２三歩成  △同銀  ▲１三桂成  △同桂  ▲同馬  △３六飛  ▲同金  △２七歩打  ▲同金  
  83 ５七馬(35)   ( 0:08/00:05:30)
*#形勢[664]△８六飛  ▲２四歩打  △３二銀  ▲１五歩  △同歩  ▲１三歩打  △同香  ▲２五桂  △１四香  ▲２三歩成  △同銀  ▲１三桂成  △同桂  ▲同馬  △２二歩打  ▲２四歩打  △同銀  
  84 ８六飛(66)   ( 0:08/00:05:35)
*#形勢[878]▲２四歩打  △３二銀  ▲１五歩  △同歩  ▲１三歩打  △同香  ▲２五桂  △２六歩打  ▲同金  △１四香  ▲２三歩成  △同銀  ▲１三桂成  △同桂  ▲同馬  △３二金  ▲２四歩打  △１六桂打  ▲同香  △同歩  
  85 ２四歩打     ( 0:08/00:05:38)
*#形勢[888]△３二銀  ▲１五歩  △６五桂  ▲６七馬  △２六歩打  ▲同金  △７六馬  ▲７八馬  △２二歩打  ▲１四歩  △１八歩打  ▲同香  △７五馬  ▲２五桂  △５七桂成  
  86 ３二銀(23)   ( 0:08/00:05:43)
*#形勢[764]▲１五歩  △同歩  ▲１三歩打  △同香  ▲２五桂  △２六歩打  ▲同金  △１二玉  ▲１三桂成  △同玉  ▲１五香  △２二玉  ▲２三香打  △同銀  ▲同歩成  △同玉  ▲８八歩打  △６五馬  ▲６六歩打  △同飛  ▲同馬  △同馬  
  87 １五歩(16)   ( 0:08/00:05:46)
*#形勢[982]△６五桂  ▲６七馬  △７六馬  ▲７八馬  △２二玉  ▲１四歩  △１五歩打  ▲同香  △２六歩打  ▲同金  △２三歩打  ▲１三歩成  △同香  ▲同香成  △同桂  
  88 ６五桂(73)   ( 0:08/00:05:51)
*#形勢[1041]▲６七馬  △７六馬  ▲７八馬  △８七馬  ▲２三歩成  △７八馬  ▲３二と  △２三馬  ▲４一と  △同馬  ▲２四歩打  △２三歩打  ▲１四歩  △２四歩  ▲１三歩成  △同香  ▲同香  △同桂  
  89 ６七馬(57)   ( 0:08/00:05:54)
*#形勢[1104]△７六馬  ▲７八馬  △２二玉  ▲１四歩  △２六歩打  ▲同金  △１七歩打  ▲同玉  △１六歩打  ▲同金  △２三歩打  ▲同歩成  △同銀  ▲２九飛  △３二金  
  90 ７六馬(87)   ( 0:08/00:05:59)
*#形勢[1172]▲７八馬  △８七馬  ▲２三歩成  △７八馬  ▲３二と  △同金  ▲７八金  △３四角打  ▲６七歩打  △５七桂成  ▲２三歩打  △１五歩  ▲５七飛  △２六歩打  ▲２二銀打  △同金  ▲同歩成  △同玉  
  91 ７八馬(67)   ( 0:08/00:06:02)
*#形勢[1165]△２二玉  ▲１四歩  △２六歩打  ▲同金  △４八歩打  ▲１三歩成  △同香  ▲同香  △同桂  ▲１四歩打  △４九歩成  ▲１三歩成  △同玉  ▲１四歩打  △２二玉  ▲１三歩成  
  92 ２二玉(11)   ( 0:08/00:06:07)
*#形勢[1078]▲１四歩  △４五歩打  ▲１三歩成  △同香  ▲同香成  △同玉  ▲１九飛  △１四歩打  ▲２六香打  △２二玉  ▲４五桂  △６二銀  ▲２三歩成  △同銀  ▲３三桂成  △同玉  ▲２三馬  △４二玉  
  93 １四歩(15)   ( 0:08/00:06:10)
*#形勢[1227]△８七馬  ▲１三歩成  △同香  ▲同香成  △同桂  ▲１四歩打  △１二歩打  ▲１九飛  △７八馬  ▲同金  △３四角打  ▲７九金  △５七桂成  ▲２三香打  △同銀  ▲同歩成  △同角  
  94 ８七馬(76)   ( 0:08/00:06:15)
*#形勢[1390]▲１二馬  △同玉  ▲１三歩成  △同桂  ▲１四歩打  △２一玉  ▲１三歩成  △３一玉  ▲２三歩成  △４二玉  ▲４五桂打  △５二玉  ▲３二と  △同金  ▲６六歩打  △７七桂成  
  95 １二馬(78)   ( 0:08/00:06:18)
*#形勢[1498]△１二玉  ▲１三歩成  △同桂  ▲１四歩打  △２五桂  ▲同桂  △２六歩打  ▲同金  △２一玉  ▲８八歩打  △７六馬  ▲１三歩成  △３一玉  ▲２三歩成  △４二玉  ▲４五桂打  
  96 １二玉(22)   ( 0:08/00:06:23)
*#形勢[1517]▲１三歩成  △同桂  ▲１四歩打  △２一玉  ▲１三歩成  △２六歩打  ▲同金  △３一玉  ▲２三歩成  △４二玉  ▲３二と  △同金  ▲４五香打  △２五歩打  ▲４四香  △同銀  
  97 １三歩成(14) ( 0:08/00:06:26)
*#形勢[1392]△１三桂  ▲１四歩打  △１八歩打  ▲同香  △２一玉  ▲１三歩成  △３一玉  ▲２三歩成  △４二玉  ▲３二と  △同金  ▲４五桂打  △５二玉  ▲５三桂成  △同銀  ▲４五桂  △２六歩打  
  98 １三桂(21)   ( 0:07/00:06:30)
*#形勢[1437]▲１四歩打  △１八歩打  ▲同香  △２二玉  ▲１三歩成  △３一玉  ▲２三歩成  △４二玉  ▲４五桂打  △５二玉  ▲３二と  △同金  ▲５三桂成  △同玉  ▲５八香打  △４三金  
  99 １四歩打     ( 0:07/00:06:33)
*#形勢[1527]△１八歩打  ▲同香  △２五桂  ▲１三歩成  △２一玉  ▲２五桂  △３一玉  ▲２三歩成  △２六歩打  ▲同金  △４二玉  ▲６六歩打  △同飛  ▲３二と  △同金  
 100 １八歩打     ( 0:07/00:06:37)
*#形勢[1541]▲１八香  △２五桂  ▲同桂  △２一玉  ▲１三歩成  △３一玉  ▲２三歩成  △４二玉  ▲３二と  △同金  ▲２四桂打  △４三金  ▲３二銀打  △５二玉  ▲４三銀成  △同玉  
 101 １八香(19)   ( 0:07/00:06:40)
*#形勢[1597]△２二玉  ▲１三歩成  △３一玉  ▲２三歩成  △４二玉  ▲３二と  △同金  ▲６三銀打  △８三飛  ▲２四桂打  △４三金  ▲７三歩打  △８六馬  ▲１九飛  △７五馬  
 102 ２二玉(12)   ( 0:07/00:06:44)
*#形勢[1770]▲１三歩成  △３一玉  ▲２三歩成  △４二玉  ▲３二と  △同金  ▲４六香打  △４五歩打  ▲同桂  △同銀  ▲同銀  △４四歩打  ▲５四銀  △同銀  
 103 １三歩成(14) ( 0:07/00:06:47)
*#形勢[1669]△３一玉  ▲２三歩成  △４二玉  ▲３二と  △同金  ▲６三銀打  △８八歩打  ▲４六香打  △２六歩打  ▲同金  △８九歩成  ▲５四銀成  △同銀  ▲同飛  △７九と  ▲４四香  
 104 ３一玉(22)   ( 0:07/00:06:51)
*#形勢[1781]▲２三歩成  △４二玉  ▲３二と  △同金  ▲４六香打  △５二玉  ▲４四香  △同銀  ▲５四飛  △５三銀  ▲４四桂打  △６三玉  ▲５三飛成  △同玉  ▲３二桂成  △５七桂成  ▲４五銀打  △３二馬  
 105 ２三歩成(24) ( 0:07/00:06:54)
*#形勢[1579]△４三銀  ▲４六香打  △４二玉  ▲３五桂打  △３四銀  ▲４四香  △同銀  ▲５四飛  △３五銀直  ▲同銀  △同銀  ▲３三と  △同玉  ▲３四銀打  △４二玉  ▲３三銀打  △３一玉  
 106 ４三銀(32)   ( 0:07/00:06:58)
*#形勢[2027]▲８八歩打  △同馬  ▲同金  △同飛成  ▲３三と  △同銀  ▲６六角打  △３八龍  ▲同玉  △４四角打  ▲同角  △同銀右  ▲３五桂打  △３四銀右  ▲１一飛打  △４二玉  ▲４五桂  
 107 ８八歩打     ( 0:07/00:07:01)
*#形勢[1972]△８八馬  ▲同金  △同飛成  ▲３三と  △同銀  ▲６六角打  △６八龍  ▲３三角成  △４二金  ▲４五桂打  △５九龍  ▲２二と  
 108 ８八馬(87)   ( 0:07/00:07:05)
*#形勢[1997]▲８八金  △同飛成  ▲３三と  △同銀  ▲６六角打  △６八龍  ▲３三角成  △４二金  ▲２三馬  △３二金打  ▲３五香打  △５九龍  ▲２二と  △４一玉  ▲３二香成  △同銀  
 109 ８八金(79)   ( 0:07/00:07:08)
*#形勢[1846]△８八飛成  ▲３三と  △同銀  ▲６六角打  △６八龍  ▲３三角成  △４二金  ▲２三馬  △３二金打  ▲３五香打  △３四歩打  ▲同香  △同銀  
 110 ８八飛成(86) ( 0:07/00:07:12)
*#形勢[1876]▲３三と  △同銀  ▲６六角打  △６八龍  ▲３三角成  △４二金  ▲３五香打  
 111 ３三と(23)   ( 0:07/00:07:15)
*#形勢[2076]△３三銀  ▲６六角打  △６八龍  ▲３三角成  △４二金  ▲４三馬  △同金  ▲３五桂打  △４二金  ▲１九飛  △３四歩打  ▲６九歩打  △７八龍  ▲３二歩打  △４一玉  
 112 ３三銀(44)   ( 0:07/00:07:19)
*#形勢[1850]▲６六角打  △６八龍  ▲３三角成  △４二金  ▲２三馬  △３二金打  ▲同馬  △同金  ▲５八金打  △５九龍  ▲同金  △４二玉  
 113 ６六角打     ( 0:07/00:07:22)
*#形勢[2606]△６八龍  ▲３三角成  △４二金  ▲４五桂打  △４四銀右  ▲同馬  △５九龍  ▲２二馬  △４一玉  ▲５三銀打  △５五角打  ▲４二銀成  △同玉  
 114 ６八龍(88)   ( 0:07/00:07:26)
*#形勢[2467]▲３三角成  △４二金  ▲４五桂  △４四銀右  ▲同馬  △同銀  ▲５四飛  △４九角打  ▲５一飛成  △４一歩打  ▲３四香打  △３三歩打  ▲２二銀打  △３二玉  ▲３三香成  △同銀  
 115 ３三角成(66) ( 0:07/00:07:29)
*#形勢[2504]△４二金  ▲４五桂  △４四銀右  ▲３四桂打  △３三銀  ▲同桂成  △３四銀  ▲２二銀打  △４一玉  ▲５四飛  △３九角打  ▲同玉  △６六角打  
 116 ４二金(41)   ( 0:07/00:07:33)
*#形勢[2603]▲４五桂打  △１七歩打  ▲５三桂成  △１八歩成  ▲同玉  △３八龍  ▲２八金  △１七歩打  ▲同玉  △２六金打  ▲同玉  △２八龍  ▲２七金打  △３三金  ▲４二銀打  △３二玉  
 117 ４五桂打     ( 0:07/00:07:36)
*#形勢[2643]△４四銀右  ▲同馬  △同銀  ▲５四飛  △２六歩打  ▲同金  △４九角打  ▲３九歩打  
 118 ４四銀(53)   ( 0:07/00:07:40)
*#形勢[2752]▲４四馬  △同銀  ▲５四飛  △４九角打  ▲５一飛成  △４一金打  ▲２二銀打  △３二玉  ▲２一銀  △４三玉  ▲５四銀打  △３四玉  ▲２五銀  △３五玉  ▲３六香打  
 119 ４四馬(33)   ( 0:07/00:07:43)
*#形勢[2752]△４四銀  ▲５四飛  △４九角打  ▲５一飛成  △４一金打  ▲２二銀打  △３二玉  ▲２一銀  △４三玉  ▲５四銀打  △３四玉  ▲２五銀  △３五玉  ▲３六香打  
 120 ４四銀(43)   ( 0:07/00:07:47)
*#形勢[3007]▲５四飛  △２六歩打  ▲５一飛成  △４一金打  ▲２二銀打  △３二玉  ▲３三歩打  △４三玉  ▲５四銀打  △３四玉  ▲２五銀  
 121 ５四飛(59)   ( 0:07/00:07:50)
*#形勢[3495]△６二角打  ▲３四香打  △３三歩打  ▲５一銀打  △５三歩打  ▲２二と  △４一玉  ▲４二銀  △同玉  ▲４四飛  △５二玉  ▲３三香成  
 122 ６二角打     ( 0:07/00:07:54)
*#形勢[3795]▲３四香打  △３三歩打  ▲５一銀打  △５三角打  ▲同桂  △同角  ▲２二銀打  △４一玉  ▲４二銀成  △同玉  ▲３三銀  △同銀  ▲同香成  △５二玉  
 123 ３四香打     ( 0:07/00:07:57)
*#形勢[4041]△３三歩打  ▲５一銀打  △３四歩  ▲６二銀  △３二金打  ▲２四角打  △３九角打  
 124 ３三歩打     ( 0:07/00:08:01)
*#形勢[3923]▲５一銀打  △５三角打  ▲同桂成  △同角  ▲２二銀打  △４一玉  ▲４二銀成  △同玉  ▲３三銀  △同銀  ▲同香成  △５二玉  ▲４三金打  △６三玉  ▲５三飛成  △７二玉  ▲４五角打  △６三銀打  
 125 ５一銀打     ( 0:07/00:08:04)
*#形勢[4361]△３八龍  ▲同玉  △４八金打  ▲同玉  △８四角  ▲５七歩打  △同桂成  ▲３八玉  △４七成桂  ▲同銀  △４八金打  ▲２八玉  △３九角打  ▲１九玉  
 126 ３八龍(68)   ( 0:07/00:08:08)
*#形勢[4967]▲３八玉  △４八金打  ▲同玉  △８四角  ▲５七歩打  △同角成  ▲同飛  △同桂成  ▲３九玉  △６九飛打  ▲２八玉  △３九角打  
 127 ３八玉(28)   ( 0:07/00:08:11)
*#形勢[4678]△４八金打  ▲２八玉  △３八金打  ▲１七玉  △４五銀  ▲６二銀成  △３九角打  ▲２六玉  △１四桂打  ▲同香  
 128 ４八金打     ( 0:07/00:08:15)
*#形勢[4496]▲２八玉  △３八金打  ▲１七玉  △２八角打  ▲同金  △４五銀  ▲６二銀成  △１六歩打  ▲同玉  △１五歩打  ▲同玉  △５四銀  ▲５一飛打  △４一歩打  
 129 ２八玉(38)   ( 0:07/00:08:18)
*#形勢[5441]△４一金打  ▲１一飛打  △２一歩打  ▲２二銀打  △３二玉  ▲４二銀成  △同金  ▲３三香成  △同銀  ▲同桂成  △同金  ▲５二飛成  △４二歩打  ▲４一銀打  
 130 ４一金打     ( 0:07/00:08:22)
*#形勢[29989]▲２二銀打  △３二玉  ▲３三香成  △同金  ▲同桂成  △同銀  ▲同銀成  △同玉  ▲３四飛打  △４三玉  ▲３三金打  
 131 ２二銀打     ( 0:01/00:08:19)
 132 ３二玉(31)   ( 0:01/00:08:23)
*#1手のみ
*#形勢[29991]▲３三香成  △同金  ▲同桂成  △同銀  ▲同銀成  △同玉  ▲３四飛打  △４三玉  ▲３三金打  
 133 ３三香成(34) ( 0:01/00:08:20)
 134 投了         ( 0:01/00:08:24)
まで133手で先手の勝ち

            ",
            'created_at' => new DateTime(),
            'updated_at' => new DateTime(),
        ]);
        
        DB::table('records')->insert([
            'user_id' => 2,
            'title' => 'ぴよ将棋レベル1同士対局',
            'first_player_name' => 'Lv1 ひよこ(R30)',
            'second_player_name' => 'Lv1 ひよこ(R30)',
            'remark' => '5分+5秒ルールでの対局',
            'record' => "
            # ----  ぴよ将棋 棋譜ファイル  ----
棋戦：ぴよ将棋 (5分+5秒)
戦型：
開始日時：2024/03/28 14:05:12
終了日時：2024/03/28 14:14:24
手合割：平手
先手：Lv1 ひよこ(R30)
後手：Lv1 ひよこ(R30)
手数----指手---------消費時間--
   1 ２六歩(27)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７六歩   ▲６八銀   
   2 ３四歩(33)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: △８四歩   △３四歩   △４二銀   
   3 ２五歩(26)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: ▲７六歩   ▲２五歩   
   4 ３三角(22)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: △３三角   
*#定跡: △３二銀   
   5 ７六歩(77)   ( 0:01/00:00:03)
*#定跡手
*#推奨定跡: ▲７六歩   
   6 ３二銀(31)   ( 0:01/00:00:03)
*#定跡手
*#定跡: △２二飛   △４四歩   △３二銀   △４二銀   
   7 ４八銀(39)   ( 0:01/00:00:04)
*#定跡手
*#定跡: ▲４八銀   
   8 ８四歩(83)   ( 0:01/00:00:04)
*#定跡手
*#定跡: △８四歩   △９四歩   
*#形勢[388]▲３三角成  △同銀  ▲７七角打  
   9 ３三角成(88) ( 0:01/00:00:05)
*#定跡: ▲３三角成   
  10 ３三銀(32)   ( 0:01/00:00:05)
*#定跡手
*#定跡: △３三銀   
*#形勢[235]▲２七角打  △４四角打  ▲６三角成  
  11 ２七角打     ( 0:01/00:00:06)
*#定跡: ▲８八銀   
*#形勢[41]△９五角打  ▲６八金  △２二飛  
  12 ９五角打     ( 0:01/00:00:06)
*#形勢[365]▲５八玉  △５二金右  ▲１八角  
  13 ５八玉(59)   ( 0:01/00:00:07)
*#形勢[48]△７二銀  ▲１六歩  △４四銀  
  14 ７二銀(71)   ( 0:01/00:00:07)
*#形勢[2223]▲９六歩  △８五歩  ▲９五歩  
  15 ９六歩(97)   ( 0:01/00:00:08)
*#形勢[2003]△４二金  ▲９五歩  
  16 ４二金(41)   ( 0:01/00:00:08)
*#形勢[2038]▲９五歩  △６四歩  
  17 ９五歩(96)   ( 0:01/00:00:09)
*#形勢[1947]△６二金  
  18 ６二金(61)   ( 0:01/00:00:09)
*#形勢[2590]▲５五角打  
  19 ５五角打     ( 0:01/00:00:10)
*#形勢[1987]△４四歩  
  20 ４四歩(43)   ( 0:01/00:00:10)
*#形勢[2536]▲６八金  
  21 ６八金(69)   ( 0:01/00:00:11)
*#形勢[1975]△１二香  
  22 １二香(11)   ( 0:01/00:00:11)
*#形勢[2540]▲３九銀  
  23 ３九銀(48)   ( 0:01/00:00:12)
*#形勢[2010]△６一玉  
  24 ６一玉(51)   ( 0:01/00:00:12)
*#形勢[2481]▲７七金  
  25 ７七金(68)   ( 0:01/00:00:13)
*#形勢[1900]△９二飛  
  26 ９二飛(82)   ( 0:01/00:00:13)
*#形勢[2492]▲６八玉  
  27 ６八玉(58)   ( 0:01/00:00:14)
*#形勢[1993]△４三金  
  28 ４三金(42)   ( 0:01/00:00:14)
*#形勢[2460]▲４八銀  
  29 ４八銀(39)   ( 0:01/00:00:15)
*#形勢[1879]△９四歩  
  30 ９四歩(93)   ( 0:01/00:00:15)
*#形勢[2429]▲３九金  
  31 ３九金(49)   ( 0:01/00:00:16)
*#形勢[1875]△２四歩  
  32 ２四歩(23)   ( 0:01/00:00:16)
*#形勢[2434]▲８六金  
  33 ８六金(77)   ( 0:01/00:00:17)
*#形勢[1866]△３五歩  
  34 ３五歩(34)   ( 0:01/00:00:17)
*#形勢[2480]▲８八角  
  35 ８八角(55)   ( 0:01/00:00:18)
*#形勢[1922]△７一玉  
  36 ７一玉(61)   ( 0:01/00:00:18)
*#形勢[2469]▲７八玉  
  37 ７八玉(68)   ( 0:01/00:00:19)
*#形勢[1918]△６一銀  
  38 ６一銀(72)   ( 0:01/00:00:19)
*#形勢[2418]▲７五金  
  39 ７五金(86)   ( 0:01/00:00:20)
*#形勢[1935]△９三桂  
  40 ９三桂(81)   ( 0:01/00:00:20)
*#形勢[2435]▲１八香  
  41 １八香(19)   ( 0:01/00:00:21)
*#形勢[1663]△２五歩  
  42 ２五歩(24)   ( 0:01/00:00:21)
*#形勢[2349]▲８四金  
  43 ８四金(75)   ( 0:01/00:00:22)
*#形勢[1822]△４二銀  
  44 ４二銀(33)   ( 0:01/00:00:22)
*#形勢[3437]▲９三金  
  45 ９三金(84)   ( 0:01/00:00:23)
*#形勢[2031]△９三飛  ▲９四歩  
  46 ９三飛(92)   ( 0:01/00:00:23)
*#形勢[1950]▲９七香  
  47 ９七香(99)   ( 0:01/00:00:24)
*#形勢[1424]△７二玉  
  48 ７二玉(71)   ( 0:01/00:00:24)
*#形勢[1964]▲２二歩打  
  49 ２二歩打     ( 0:01/00:00:25)
*#形勢[1385]△５四歩  
  50 ５四歩(53)   ( 0:01/00:00:25)
*#形勢[2699]▲２一歩成  
  51 ２一歩成(22) ( 0:01/00:00:26)
*#形勢[2520]△９五歩  
  52 ９五歩(94)   ( 0:01/00:00:26)
*#形勢[3244]▲９五香  
  53 ９五香(97)   ( 0:01/00:00:27)
*#形勢[2092]△９五飛  
  54 ９五飛(93)   ( 0:01/00:00:27)
*#形勢[2419]▲４五桂打  
  55 ４五桂打     ( 0:01/00:00:28)
*#形勢[899]△４五歩  
  56 ４五歩(44)   ( 0:01/00:00:28)
*#形勢[1541]▲１一角成  
  57 １一角成(88) ( 0:01/00:00:29)
*#形勢[666]△９七飛成  
  58 ９七飛成(95) ( 0:01/00:00:29)
*#形勢[3624]▲９七桂  
  59 ９七桂(89)   ( 0:01/00:00:30)
*#形勢[2425]△９七香成  
  60 ９七香成(91) ( 0:01/00:00:30)
*#形勢[3334]▲１二馬  
  61 １二馬(11)   ( 0:01/00:00:31)
*#形勢[3143]△９一桂打  
  62 ９一桂打     ( 0:01/00:00:31)
*#形勢[3847]▲１三馬  
  63 １三馬(12)   ( 0:01/00:00:32)
*#形勢[3336]△３三銀  
  64 ３三銀(42)   ( 0:01/00:00:32)
*#形勢[3941]▲３五馬  
  65 ３五馬(13)   ( 0:01/00:00:33)
*#形勢[3501]△９四歩打  
  66 ９四歩打     ( 0:01/00:00:33)
*#形勢[4104]▲４五馬  
  67 ４五馬(35)   ( 0:01/00:00:34)
*#形勢[3727]△２四銀  
  68 ２四銀(33)   ( 0:01/00:00:34)
*#形勢[4267]▲６八玉  
  69 ６八玉(78)   ( 0:01/00:00:35)
*#形勢[3687]△５三金上  
  70 ５三金(62)   ( 0:01/00:00:35)
*#形勢[4298]▲５六馬  
  71 ５六馬(45)   ( 0:01/00:00:36)
*#形勢[3724]△４四金直  
  72 ４四金(43)   ( 0:01/00:00:36)
*#形勢[4306]▲５九銀  
  73 ５九銀(48)   ( 0:01/00:00:37)
*#形勢[3713]△６四金  
  74 ６四金(53)   ( 0:01/00:00:37)
*#形勢[4236]▲２二と  
  75 ２二と(21)   ( 0:01/00:00:38)
*#形勢[3719]△８五歩打  
  76 ８五歩打     ( 0:01/00:00:38)
*#形勢[4303]▲６六馬  
  77 ６六馬(56)   ( 0:01/00:00:39)
*#形勢[3757]△５二銀  
  78 ５二銀(61)   ( 0:01/00:00:39)
*#形勢[5353]▲４四馬  
  79 ４四馬(66)   ( 0:01/00:00:40)
*#形勢[5155]△６一玉  
  80 ６一玉(72)   ( 0:01/00:00:40)
*#形勢[5857]▲５四角  
  81 ５四角(27)   ( 0:01/00:00:41)
*#形勢[3508]△５四金  
  82 ５四金(64)   ( 0:01/00:00:41)
*#形勢[5177]▲５四馬  
  83 ５四馬(44)   ( 0:01/00:00:42)
*#形勢[4665]△１五銀  
  84 １五銀(24)   ( 0:01/00:00:42)
*#形勢[5208]▲４八銀  
  85 ４八銀(59)   ( 0:01/00:00:43)
*#形勢[4664]△６二玉  
  86 ６二玉(61)   ( 0:01/00:00:43)
*#形勢[5263]▲４四馬  
  87 ４四馬(54)   ( 0:01/00:00:44)
*#形勢[4686]△５一玉  
  88 ５一玉(62)   ( 0:01/00:00:44)
*#形勢[5316]▲３一と  
  89 ３一と(22)   ( 0:01/00:00:45)
*#形勢[4775]△６一銀  
  90 ６一銀(52)   ( 0:01/00:00:45)
*#形勢[5498]▲２五飛  
  91 ２五飛(28)   ( 0:01/00:00:46)
*#形勢[4747]△８七成香  
  92 ８七成香(97) ( 0:01/00:00:46)
*#形勢[6444]▲１五飛  
  93 １五飛(25)   ( 0:01/00:00:47)
*#形勢[6039]△６二銀  
  94 ６二銀(61)   ( 0:01/00:00:47)
*#形勢[6874]▲１一飛成  
  95 １一飛成(15) ( 0:01/00:00:48)
*#形勢[6535]△６四歩  
  96 ６四歩(63)   ( 0:01/00:00:48)
*#形勢[7138]▲５五馬  
  97 ５五馬(44)   ( 0:01/00:00:49)
*#形勢[6604]△８六成香  
  98 ８六成香(87) ( 0:01/00:00:49)
*#形勢[7169]▲２五歩打  
  99 ２五歩打     ( 0:01/00:00:50)
*#形勢[6575]△９五歩  
 100 ９五歩(94)   ( 0:01/00:00:50)
*#形勢[7171]▲９三歩打  
 101 ９三歩打     ( 0:01/00:00:51)
*#形勢[6573]△７六成香  
 102 ７六成香(86) ( 0:01/00:00:51)
*#形勢[7034]▲９二歩成  
 103 ９二歩成(93) ( 0:01/00:00:52)
*#形勢[6953]△２三歩打  
 104 ２三歩打     ( 0:01/00:00:52)
*#形勢[8291]▲９一と  
 105 ９一と(92)   ( 0:01/00:00:53)
*#形勢[7720]△８七成香  
 106 ８七成香(76) ( 0:01/00:00:53)
*#形勢[8404]▲６九桂打  
 107 ６九桂打     ( 0:01/00:00:54)
*#形勢[7763]△５三銀  
 108 ５三銀(62)   ( 0:01/00:00:54)
*#形勢[8358]▲３三馬  
 109 ３三馬(55)   ( 0:01/00:00:55)
*#形勢[7744]△５二玉  
 110 ５二玉(51)   ( 0:01/00:00:55)
*#形勢[8432]▲６六馬  
 111 ６六馬(33)   ( 0:01/00:00:56)
*#形勢[7860]△８六成香  
 112 ８六成香(87) ( 0:01/00:00:56)
*#形勢[8453]▲１四龍  
 113 １四龍(11)   ( 0:01/00:00:57)
*#形勢[7851]△４四角打  
 114 ４四角打     ( 0:01/00:00:57)
*#形勢[10222]▲４四龍  
 115 ４四龍(14)   ( 0:01/00:00:58)
*#形勢[6979]△４四銀  
 116 ４四銀(53)   ( 0:01/00:00:58)
*#形勢[8696]▲４四馬  
 117 ４四馬(66)   ( 0:01/00:00:59)
*#形勢[8168]△７六成香  
 118 ７六成香(86) ( 0:01/00:00:59)
*#形勢[8720]▲８九銀打  
 119 ８九銀打     ( 0:01/00:01:00)
*#形勢[8189]△８七成香  
 120 ８七成香(76) ( 0:01/00:01:00)
*#形勢[8747]▲９八歩打  
 121 ９八歩打     ( 0:01/00:01:01)
*#形勢[8196]△７四歩  
 122 ７四歩(73)   ( 0:01/00:01:01)
*#形勢[8849]▲４五角打  
 123 ４五角打     ( 0:01/00:01:02)
*#形勢[8313]△６一玉  
 124 ６一玉(52)   ( 0:01/00:01:02)
*#形勢[8929]▲２三角成  
 125 ２三角成(45) ( 0:01/00:01:03)
*#形勢[8635]△５二歩打  
 126 ５二歩打     ( 0:01/00:01:03)
*#形勢[9191]▲７六歩打  
 127 ７六歩打     ( 0:01/00:01:04)
*#形勢[8682]△７二玉  
 128 ７二玉(61)   ( 0:01/00:01:04)
*#形勢[9196]▲１六歩  
 129 １六歩(17)   ( 0:01/00:01:05)
*#形勢[8469]△９八成香  
 130 ９八成香(87) ( 0:01/00:01:05)
*#形勢[9559]▲９八銀  
 131 ９八銀(89)   ( 0:01/00:01:06)
*#形勢[9450]△２七歩打  
 132 ２七歩打     ( 0:01/00:01:06)
*#形勢[9980]▲８九銀  
 133 ８九銀(98)   ( 0:01/00:01:07)
*#形勢[9457]△６一玉  
 134 ６一玉(72)   ( 0:01/00:01:07)
*#形勢[10006]▲８八馬  
 135 ８八馬(44)   ( 0:01/00:01:08)
*#形勢[9452]△４二飛打  
 136 ４二飛打     ( 0:01/00:01:08)
*#形勢[10037]▲２六香打  
 137 ２六香打     ( 0:01/00:01:09)
*#形勢[9504]△９六歩  
 138 ９六歩(95)   ( 0:01/00:01:09)
*#形勢[10040]▲９八歩打  
 139 ９八歩打     ( 0:01/00:01:10)
*#形勢[9564]△６六桂打  
 140 ６六桂打     ( 0:01/00:01:10)
*#形勢[10875]▲６六馬  
 141 ６六馬(88)   ( 0:01/00:01:11)
*#形勢[10623]△７一玉  
 142 ７一玉(61)   ( 0:01/00:01:11)
*#形勢[11105]▲５六桂打  
 143 ５六桂打     ( 0:01/00:01:12)
*#形勢[10530]△６一玉  
 144 ６一玉(71)   ( 0:01/00:01:12)
*#形勢[11077]▲７七馬  
 145 ７七馬(66)   ( 0:01/00:01:13)
*#形勢[10646]△４三飛  
 146 ４三飛(42)   ( 0:01/00:01:13)
*#形勢[11144]▲７八銀左  
 147 ７八銀(89)   ( 0:01/00:01:14)
*#形勢[8381]△２三飛  
 148 ２三飛(43)   ( 0:01/00:01:14)
*#形勢[8878]▲８九歩打  
 149 ８九歩打     ( 0:01/00:01:15)
*#形勢[8335]△３五角打  
 150 ３五角打     ( 0:01/00:01:15)
*#形勢[8834]▲８一と  
 151 ８一と(91)   ( 0:01/00:01:16)
*#形勢[7995]△２六角  
 152 ２六角(35)   ( 0:01/00:01:16)
*#形勢[8208]▲４四桂  
 153 ４四桂(56)   ( 0:01/00:01:17)
*#形勢[7610]△８六香打  
 154 ８六香打     ( 0:01/00:01:17)
*#形勢[8213]▲３二桂成  
 155 ３二桂成(44) ( 0:01/00:01:18)
*#形勢[7537]△８九香成  
 156 ８九香成(86) ( 0:01/00:01:18)
*#形勢[8634]▲８九銀  
 157 ８九銀(78)   ( 0:01/00:01:19)
*#形勢[8196]△７一角  
 158 ７一角(26)   ( 0:01/00:01:19)
*#形勢[9782]▲７一と  △同玉  
 159 ７一と(81)   ( 0:01/00:01:20)
*#形勢[10050]△７一玉  
 160 ７一玉(61)   ( 0:01/00:01:20)
*#形勢[10204]▲７八玉  
 161 ７八玉(68)   ( 0:01/00:01:21)
*#形勢[9616]△２五飛  
 162 ２五飛(23)   ( 0:01/00:01:21)
*#形勢[10077]▲４五香打  
 163 ４五香打     ( 0:01/00:01:22)
*#形勢[8959]△２八歩成  
 164 ２八歩成(27) ( 0:01/00:01:22)
*#形勢[9689]▲２八金  
 165 ２八金(39)   ( 0:01/00:01:23)
*#形勢[8380]△２八飛成  
 166 ２八飛成(25) ( 0:01/00:01:23)
*#形勢[8655]▲４一香成  
 167 ４一香成(45) ( 0:01/00:01:24)
*#形勢[7235]△４八龍  
 168 ４八龍(28)   ( 0:01/00:01:24)
*#形勢[7209]▲５八桂打  
 169 ５八桂打     ( 0:01/00:01:25)
*#形勢[6109]△５八龍  
 170 ５八龍(48)   ( 0:01/00:01:25)
*#形勢[5976]▲８七玉  
 171 ８七玉(78)   ( 0:01/00:01:26)
*#形勢[4989]△１八龍  
 172 １八龍(58)   ( 0:01/00:01:26)
*#形勢[5486]▲８三歩打  
 173 ８三歩打     ( 0:01/00:01:27)
*#形勢[4487]△２九龍  
 174 ２九龍(18)   ( 0:01/00:01:27)
*#形勢[4652]▲３六角打  
 175 ３六角打     ( 0:01/00:01:28)
*#形勢[3912]△６六桂打  
 176 ６六桂打     ( 0:01/00:01:28)
*#形勢[5413]▲６六歩  
 177 ６六歩(67)   ( 0:01/00:01:29)
*#形勢[4420]△６九龍  
 178 ６九龍(29)   ( 0:01/00:01:29)
*#形勢[4774]▲７八馬  
 179 ７八馬(77)   ( 0:01/00:01:30)
*#形勢[4000]△６七桂打  
 180 ６七桂打     ( 0:01/00:01:30)
*#形勢[6775]▲６九馬  
 181 ６九馬(78)   ( 0:01/00:01:31)
*#形勢[5682]△７九桂成  
 182 ７九桂成(67) ( 0:01/00:01:31)
*#形勢[6529]▲７九馬  
 183 ７九馬(69)   ( 0:01/00:01:32)
*#形勢[6184]△７七銀打  
 184 ７七銀打     ( 0:01/00:01:32)
*#形勢[7776]▲７七玉  
 185 ７七玉(87)   ( 0:01/00:01:33)
*#形勢[7351]△６七香打  
 186 ６七香打     ( 0:01/00:01:33)
*#形勢[8269]▲６七玉  
 187 ６七玉(77)   ( 0:01/00:01:34)
*#形勢[8090]△１三歩打  
 188 １三歩打     ( 0:01/00:01:34)
*#形勢[8737]▲１五飛打  
 189 １五飛打     ( 0:01/00:01:35)
*#形勢[8209]△１四金打  
 190 １四金打     ( 0:01/00:01:35)
*#形勢[9553]▲１四飛  
 191 １四飛(15)   ( 0:01/00:01:36)
*#形勢[8062]△１四歩  ▲８二歩成  
 192 １四歩(13)   ( 0:01/00:01:36)
*#形勢[7690]▲２八金打  
 193 ２八金打     ( 0:01/00:01:37)
*#形勢[7104]△４三歩打  
 194 ４三歩打     ( 0:01/00:01:37)
*#形勢[7750]▲２四桂打  
 195 ２四桂打     ( 0:01/00:01:38)
*#形勢[7174]△４四歩  
 196 ４四歩(43)   ( 0:01/00:01:38)
*#形勢[7795]▲５六歩  
 197 ５六歩(57)   ( 0:01/00:01:39)
*#形勢[7267]△４五飛打  
 198 ４五飛打     ( 0:01/00:01:39)
*#形勢[7980]▲１四角  
 199 １四角(36)   ( 0:01/00:01:40)
*#形勢[7449]△１三歩打  
 200 １三歩打     ( 0:01/00:01:40)
*#形勢[8057]▲７三銀打  
 201 ７三銀打     ( 0:01/00:01:41)
*#形勢[5592]△１四歩  
 202 １四歩(13)   ( 0:01/00:01:41)
*#形勢[6501]▲８二歩成  
 203 ８二歩成(83) ( 0:01/00:01:42)
 204 ６一玉(71)   ( 0:01/00:01:42)
*#1手のみ
*#形勢[6710]▲６四銀成  
 205 ６四銀成(73) ( 0:01/00:01:43)
*#形勢[5740]△４七飛成  
 206 ４七飛成(45) ( 0:01/00:01:43)
*#形勢[5888]▲７八玉  
 207 ７八玉(67)   ( 0:01/00:01:44)
*#形勢[5041]△９七歩成  
 208 ９七歩成(96) ( 0:01/00:01:44)
*#形勢[5900]▲９七馬  
 209 ９七馬(79)   ( 0:01/00:01:45)
*#形勢[5557]△３八歩打  
 210 ３八歩打     ( 0:01/00:01:45)
*#形勢[6156]▲２五歩打  
 211 ２五歩打     ( 0:01/00:01:46)
*#形勢[5395]△３九歩成  
 212 ３九歩成(38) ( 0:01/00:01:46)
*#形勢[5628]▲８三香打  
 213 ８三香打     ( 0:01/00:01:47)
*#形勢[5114]△９五角打  
 214 ９五角打     ( 0:01/00:01:47)
*#形勢[5681]▲５四成銀  
 215 ５四成銀(64) ( 0:01/00:01:48)
*#形勢[5038]△７七角成  
 216 ７七角成(95) ( 0:01/00:01:48)
*#形勢[5316]▲６九玉  
 217 ６九玉(78)   ( 0:01/00:01:49)
*#形勢[4741]△７六馬  
 218 ７六馬(77)   ( 0:01/00:01:49)
*#形勢[5350]▲１二桂成  
 219 １二桂成(24) ( 0:01/00:01:50)
*#形勢[3715]△５四馬  
 220 ５四馬(76)   ( 0:01/00:01:50)
*#形勢[4222]▲７八歩打  
 221 ７八歩打     ( 0:01/00:01:51)
*#形勢[3636]△８七銀打  
 222 ８七銀打     ( 0:01/00:01:51)
*#形勢[4167]▲９三金打  
 223 ９三金打     ( 0:01/00:01:52)
*#形勢[3607]△９五歩打  
 224 ９五歩打     ( 0:01/00:01:52)
*#形勢[4188]▲４二馬  
 225 ４二馬(97)   ( 0:01/00:01:53)
*#形勢[3365]△９八銀成  
 226 ９八銀成(87) ( 0:01/00:01:53)
*#形勢[4863]▲９八銀  
 227 ９八銀(89)   ( 0:01/00:01:54)
*#形勢[3789]△９八馬  
 228 ９八馬(54)   ( 0:01/00:01:54)
*#形勢[4002]▲３四銀打  
 229 ３四銀打     ( 0:01/00:01:55)
*#形勢[3377]△６三銀打  
 230 ６三銀打     ( 0:01/00:01:55)
*#形勢[4074]▲２四馬  
 231 ２四馬(42)   ( 0:01/00:01:56)
*#形勢[3528]△９七龍  
 232 ９七龍(47)   ( 0:01/00:01:56)
*#形勢[4118]▲４三歩打  
 233 ４三歩打     ( 0:01/00:01:57)
*#形勢[3519]△６七龍  
 234 ６七龍(97)   ( 0:01/00:01:57)
*#形勢[4052]▲５九玉  
 235 ５九玉(69)   ( 0:01/00:01:58)
*#形勢[3517]△８八馬  
 236 ８八馬(98)   ( 0:01/00:01:58)
*#形勢[4536]▲４二歩成  
 237 ４二歩成(43) ( 0:01/00:01:59)
*#形勢[4025]△５四銀  
 238 ５四銀(63)   ( 0:01/00:01:59)
*#形勢[4616]▲６八馬  
 239 ６八馬(24)   ( 0:01/00:02:00)
*#形勢[4032]△６六馬  
 240 ６六馬(88)   ( 0:01/00:02:00)
*#形勢[4483]▲３三銀成  
 241 ３三銀成(34) ( 0:01/00:02:01)
*#形勢[2697]△９三馬  
 242 ９三馬(66)   ( 0:01/00:02:01)
*#形勢[5558]▲６七馬  
 243 ６七馬(68)   ( 0:01/00:02:02)
*#形勢[5155]△６三銀  
 244 ６三銀(54)   ( 0:01/00:02:02)
*#形勢[5913]▲６五飛打  
 245 ６五飛打     ( 0:01/00:02:03)
*#形勢[5387]△８六歩  
 246 ８六歩(85)   ( 0:01/00:02:03)
*#形勢[7537]▲６三飛成  
 247 ６三飛成(65) ( 0:01/00:02:04)
*#形勢[7162]△６二金打  
 248 ６二金打     ( 0:01/00:02:04)
*#形勢[7704]▲７六馬  
 249 ７六馬(67)   ( 0:01/00:02:05)
*#形勢[4525]△６三金  
 250 ６三金(62)   ( 0:01/00:02:05)
*#形勢[4817]▲４八銀打  
 251 ４八銀打     ( 0:01/00:02:06)
*#形勢[4311]△５三歩  
 252 ５三歩(52)   ( 0:01/00:02:06)
*#形勢[5114]▲３九銀  
 253 ３九銀(48)   ( 0:01/00:02:07)
*#形勢[3882]△３九馬  
 254 ３九馬(93)   ( 0:01/00:02:07)
*#形勢[4468]▲６六歩打  
 255 ６六歩打     ( 0:01/00:02:08)
*#形勢[2917]△２八馬  
 256 ２八馬(39)   ( 0:01/00:02:08)
*#形勢[3123]▲２二成桂右  
 257 ２二成桂(12) ( 0:01/00:02:09)
*#形勢[2523]△６七銀打  
 258 ６七銀打     ( 0:01/00:02:09)
*#形勢[4140]▲６七馬  
 259 ６七馬(76)   ( 0:01/00:02:10)
*#形勢[3418]△８七歩成  
 260 ８七歩成(86) ( 0:01/00:02:10)
*#形勢[3658]▲１一銀打  
 261 １一銀打     ( 0:01/00:02:11)
*#形勢[3042]△３五歩打  
 262 ３五歩打     ( 0:01/00:02:11)
*#形勢[3679]▲４八玉  
 263 ４八玉(59)   ( 0:01/00:02:12)
*#形勢[3085]△５四歩  
 264 ５四歩(53)   ( 0:01/00:02:12)
*#形勢[3688]▲７七歩  
 265 ７七歩(78)   ( 0:01/00:02:13)
*#形勢[3113]△８六金打  
 266 ８六金打     ( 0:01/00:02:13)
*#形勢[3668]▲８一と  
 267 ８一と(82)   ( 0:01/00:02:14)
*#形勢[3060]△７七金  
 268 ７七金(86)   ( 0:01/00:02:14)
*#形勢[3687]▲８二香成  
 269 ８二香成(83) ( 0:01/00:02:15)
*#形勢[1386]△６七金  
 270 ６七金(77)   ( 0:01/00:02:15)
*#形勢[1481]▲７一と  
 271 ７一と(81)   ( 0:01/00:02:16)
 272 ６二玉(61)   ( 0:01/00:02:16)
*#1手のみ
*#形勢[1478]▲９二成香  
 273 ９二成香(82) ( 0:01/00:02:17)
*#形勢[379]△７一玉  
 274 ７一玉(62)   ( 0:01/00:02:17)
*#形勢[758]▲２一と  
 275 ２一と(31)   ( 0:01/00:02:18)
*#形勢[109]△６六金  
 276 ６六金(67)   ( 0:01/00:02:18)
*#形勢[589]▲５一成香  
 277 ５一成香(41) ( 0:01/00:02:19)
*#形勢[-5]△６二歩打  
 278 ６二歩打     ( 0:01/00:02:19)
*#形勢[559]▲９一成香  
 279 ９一成香(92) ( 0:01/00:02:20)
*#形勢[5]△５六金  
 280 ５六金(66)   ( 0:01/00:02:20)
*#形勢[331]▲８三歩打  
 281 ８三歩打     ( 0:01/00:02:21)
*#形勢[-255]△５五角打  
 282 ５五角打     ( 0:01/00:02:21)
*#形勢[269]▲３四成銀  
 283 ３四成銀(33) ( 0:01/00:02:22)
*#形勢[-635]△９一角  
 284 ９一角(55)   ( 0:01/00:02:22)
*#形勢[-337]▲４四成銀  
 285 ４四成銀(34) ( 0:01/00:02:23)
*#形勢[-921]△３一香打  
 286 ３一香打     ( 0:01/00:02:23)
*#形勢[338]▲３一成桂直  
 287 ３一成桂(32) ( 0:01/00:02:24)
*#形勢[-551]△３七馬  
 288 ３七馬(28)   ( 0:01/00:02:24)
*#形勢[-46]▲３九玉  
 289 ３九玉(48)   ( 0:01/00:02:25)
*#形勢[-456]△７七と  
 290 ７七と(87)   ( 0:01/00:02:25)
*#形勢[123]▲４八香打  
 291 ４八香打     ( 0:01/00:02:26)
*#形勢[-453]△７三角  
 292 ７三角(91)   ( 0:01/00:02:26)
*#形勢[123]▲３二と  
 293 ３二と(42)   ( 0:01/00:02:27)
*#形勢[-446]△２七歩打  
 294 ２七歩打     ( 0:01/00:02:27)
*#形勢[168]▲５四成銀  
 295 ５四成銀(44) ( 0:01/00:02:28)
*#形勢[-1276]△５四金  
 296 ５四金(63)   ( 0:01/00:02:28)
*#形勢[-689]▲４二香成  
 297 ４二香成(48) ( 0:01/00:02:29)
*#形勢[-1677]△２八歩成  
 298 ２八歩成(27) ( 0:01/00:02:29)
 299 ４九玉(39)   ( 0:01/00:02:30)
*#1手のみ
*#形勢[-1729]△４七馬  
 300 ４七馬(37)   ( 0:01/00:02:30)
*#形勢[-1203]▲５八歩打  
 301 ５八歩打     ( 0:01/00:02:31)
*#形勢[-1864]△２五馬  
 302 ２五馬(47)   ( 0:01/00:02:31)
*#形勢[-1460]▲１七飛打  
 303 １七飛打     ( 0:01/00:02:32)
*#形勢[-2102]△６五銀打  
 304 ６五銀打     ( 0:01/00:02:32)
*#形勢[-1279]▲７七飛  
 305 ７七飛(17)   ( 0:01/00:02:33)
*#形勢[-1451]△５七金  
 306 ５七金(56)   ( 0:01/00:02:33)
*#形勢[472]▲５七飛  
 307 ５七飛(77)   ( 0:01/00:02:34)
*#形勢[-164]△３四馬  
 308 ３四馬(25)   ( 0:01/00:02:34)
*#形勢[429]▲９八歩打  
 309 ９八歩打     ( 0:01/00:02:35)
*#形勢[-163]△１六馬  
 310 １六馬(34)   ( 0:01/00:02:35)
*#形勢[293]▲５九玉  
 311 ５九玉(49)   ( 0:01/00:02:36)
*#形勢[-300]△２七馬  
 312 ２七馬(16)   ( 0:01/00:02:36)
*#形勢[278]▲３三と  
 313 ３三と(32)   ( 0:01/00:02:37)
*#形勢[-321]△１九と  
 314 １九と(28)   ( 0:01/00:02:37)
*#形勢[2269]▲２七飛  
 315 ２七飛(57)   ( 0:01/00:02:38)
*#形勢[2019]△９一角  
 316 ９一角(73)   ( 0:01/00:02:38)
*#形勢[2825]▲２三飛成  
 317 ２三飛成(27) ( 0:01/00:02:39)
*#形勢[2399]△３七角成  
 318 ３七角成(91) ( 0:01/00:02:39)
*#形勢[2866]▲４八角打  
 319 ４八角打     ( 0:01/00:02:40)
*#形勢[2325]△２七歩打  
 320 ２七歩打     ( 0:01/00:02:40)
*#形勢[4892]▲３七角  
 321 ３七角(48)   ( 0:01/00:02:41)
*#形勢[4651]△５五歩打  
 322 ５五歩打     ( 0:01/00:02:41)
*#形勢[5667]▲１九角  
 323 １九角(37)   ( 0:01/00:02:42)
*#形勢[5250]△４五金  
 324 ４五金(54)   ( 0:01/00:02:42)
*#形勢[5930]▲２七龍  
 325 ２七龍(23)   ( 0:01/00:02:43)
*#形勢[5358]△３六歩  
 326 ３六歩(35)   ( 0:01/00:02:43)
*#形勢[5972]▲３二歩打  
 327 ３二歩打     ( 0:01/00:02:44)
*#形勢[5384]△７五歩  
 328 ７五歩(74)   ( 0:01/00:02:44)
*#形勢[5991]▲５七角打  
 329 ５七角打     ( 0:01/00:02:45)
*#形勢[5426]△８四歩打  
 330 ８四歩打     ( 0:01/00:02:45)
*#形勢[6147]▲７五角  
 331 ７五角(57)   ( 0:01/00:02:46)
*#形勢[5581]△７三歩打  
 332 ７三歩打     ( 0:01/00:02:46)
*#形勢[6194]▲２八角  
 333 ２八角(19)   ( 0:01/00:02:47)
*#形勢[5665]△５四銀  
 334 ５四銀(65)   ( 0:01/00:02:47)
*#形勢[6365]▲８四角  
 335 ８四角(75)   ( 0:01/00:02:48)
*#形勢[5809]△６三歩  
 336 ６三歩(62)   ( 0:01/00:02:48)
*#形勢[6534]▲９三角成  
 337 ９三角成(84) ( 0:01/00:02:49)
*#形勢[5994]△７二玉  
 338 ７二玉(71)   ( 0:01/00:02:49)
*#形勢[7089]▲８二歩成  
 339 ８二歩成(83) ( 0:01/00:02:50)
 340 ６二玉(72)   ( 0:01/00:02:50)
*#1手のみ
*#形勢[7115]▲６六馬  
 341 ６六馬(93)   ( 0:01/00:02:51)
*#形勢[6664]△４四金  
 342 ４四金(45)   ( 0:01/00:02:51)
*#形勢[7397]▲３六龍  
 343 ３六龍(27)   ( 0:01/00:02:52)
*#形勢[6843]△８七歩打  
 344 ８七歩打     ( 0:01/00:02:52)
*#形勢[7409]▲４三歩打  
 345 ４三歩打     ( 0:01/00:02:53)
*#形勢[6809]△４三金  
 346 ４三金(44)   ( 0:01/00:02:53)
*#形勢[7972]▲４三成香  
 347 ４三成香(42) ( 0:01/00:02:54)
*#形勢[7154]△４三銀  
 348 ４三銀(54)   ( 0:01/00:02:54)
*#形勢[8211]▲４三と  
 349 ４三と(33)   ( 0:01/00:02:55)
*#形勢[7253]△５一玉  
 350 ５一玉(62)   ( 0:01/00:02:55)
*#形勢[7865]▲４二金打  
 351 ４二金打     ( 0:01/00:02:56)
*#形勢[7296]△６二玉  
 352 ６二玉(51)   ( 0:01/00:02:56)
*#形勢[7900]▲４九銀打  
 353 ４九銀打     ( 0:01/00:02:57)
*#形勢[7247]△１三香打  
 354 １三香打     ( 0:01/00:02:57)
*#形勢[7901]▲５五馬  
 355 ５五馬(66)   ( 0:01/00:02:58)
*#形勢[7284]△４四香打  
 356 ４四香打     ( 0:01/00:02:58)
*#形勢[8186]▲４四馬  
 357 ４四馬(55)   ( 0:01/00:02:59)
*#形勢[8335]△５三金打  
 358 ５三金打     ( 0:01/00:02:59)
*#形勢[9891]▲５三と  
 359 ５三と(43)   ( 0:01/00:03:00)
 360 ６一玉(62)   ( 0:01/00:03:00)
*#1手のみ
*#形勢[10128]▲６二金打  
 361 ６二金打     ( 0:01/00:03:01)
 362 投了         ( 0:01/00:03:01)
まで361手で先手の勝ち

            ",
            'created_at' => new DateTime(),
            'updated_at' => new DateTime(),
        ]);
        
        DB::table('records')->insert([
            'user_id' => 3,
            'title' => 'ぴよ将棋レベル5同士対局',
            'first_player_name' => 'Lv5 ひより(R150)',
            'second_player_name' => 'Lv5 ひより(R150)',
            'remark' => '5分+5秒ルールでの対局',
            'record' => "
            # ----  ぴよ将棋 棋譜ファイル  ----
棋戦：ぴよ将棋 (5分+5秒)
戦型：
開始日時：2024/03/28 15:28:02
終了日時：2024/03/28 15:32:48
手合割：平手
先手：Lv5 ひより(R150)
後手：Lv5 ひより(R150)
手数----指手---------消費時間--
   1 ２六歩(27)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７六歩   ▲６八銀   
   2 ８四歩(83)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: △８四歩   △３四歩   △４二銀   
   3 ２五歩(26)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: ▲２五歩   ▲７六歩   
   4 ８五歩(84)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: △８五歩   
*#定跡: △３二金   
   5 ７六歩(77)   ( 0:01/00:00:03)
*#定跡手
*#推奨定跡: ▲７八金   ▲７六歩   ▲９六歩   
   6 ３二金(41)   ( 0:01/00:00:03)
*#定跡手
*#推奨定跡: △３二金   △３四歩   
   7 ７七角(88)   ( 0:01/00:00:04)
*#定跡手
*#推奨定跡: ▲７七角   
*#定跡: ▲２四歩   ▲７八金   
   8 ３四歩(33)   ( 0:01/00:00:04)
*#定跡手
*#推奨定跡: △３四歩   
   9 ６六歩(67)   ( 0:01/00:00:05)
*#定跡手
*#推奨定跡: ▲８八銀   
*#定跡: ▲６八銀   ▲７八銀   ▲６六歩   
  10 ３三角(22)   ( 0:01/00:00:05)
*#定跡手
*#定跡: △３三角   
  11 ６八銀(79)   ( 0:01/00:00:06)
*#定跡手
*#定跡: ▲７八銀   ▲４八銀   ▲５八金右   ▲６八銀   
  12 ４四歩(43)   ( 0:01/00:00:06)
*#定跡手
*#定跡: △４二銀   △５四歩   △２二銀   △６二銀   △４四歩   
*#形勢[-111]▲６七銀  △６二銀  ▲１六歩  △７一銀  
  13 ６七銀(68)   ( 0:01/00:00:07)
*#定跡: ▲６七銀   
  14 ４二銀(31)   ( 0:01/00:00:07)
*#定跡手
*#定跡: △６二銀   △４二銀   
  15 ３六歩(37)   ( 0:01/00:00:08)
*#定跡手
*#定跡: ▲３六歩   
*#形勢[95]△６四歩  ▲２七飛  △５四歩  ▲４八金  
  16 ６四歩(63)   ( 0:01/00:00:08)
*#定跡: △７四歩   
*#形勢[-83]▲１六歩  △１四歩  
  17 １六歩(17)   ( 0:01/00:00:09)
*#形勢[41]△４五歩  ▲３八金  △８六歩  ▲同角  
  18 ４五歩(44)   ( 0:01/00:00:09)
*#形勢[56]▲３七桂  △５五角  ▲４五桂  △９四歩  
  19 ３七桂(29)   ( 0:01/00:00:10)
*#形勢[141]△３五歩  ▲同歩  
  20 ３五歩(34)   ( 0:01/00:00:10)
*#形勢[122]▲３五歩  △５五角  ▲４八玉  △４三銀  
  21 ３五歩(36)   ( 0:01/00:00:11)
*#形勢[367]△２二角  ▲４五桂  
  22 ２二角(33)   ( 0:01/00:00:11)
*#形勢[264]▲４五桂  △６二銀  ▲２四歩  △同歩  ▲同飛  
  23 ４五桂(37)   ( 0:01/00:00:12)
*#形勢[216]△３一角  
  24 ３一角(22)   ( 0:01/00:00:12)
*#形勢[699]▲８八角  
  25 ８八角(77)   ( 0:01/00:00:13)
*#形勢[378]△２二角  ▲２四歩  △同歩  ▲６八玉  
  26 ２二角(31)   ( 0:01/00:00:13)
*#形勢[662]▲１八香  
  27 １八香(19)   ( 0:01/00:00:14)
*#形勢[405]△５五角  ▲２四歩  
  28 ５五角(22)   ( 0:01/00:00:14)
*#形勢[587]▲９八香  
  29 ９八香(99)   ( 0:01/00:00:15)
*#形勢[98]△３七角成  ▲４八飛  △同馬  ▲同金  
  30 ３七角成(55) ( 0:01/00:00:15)
*#形勢[21]▲４八飛  △９二香  
  31 ４八飛(28)   ( 0:01/00:00:16)
*#形勢[60]△４八馬  ▲同玉  △１九飛打  ▲２八角打  
  32 ４八馬(37)   ( 0:01/00:00:16)
*#形勢[62]▲４八玉  △８六歩  ▲３八銀  
  33 ４八玉(59)   ( 0:01/00:00:17)
*#形勢[-202]△５二玉  
  34 ５二玉(51)   ( 0:01/00:00:17)
*#形勢[488]▲５五角打  △１二香  ▲１一角成  
  35 ５五角打     ( 0:01/00:00:18)
*#形勢[-18]△３三金  
  36 ３三金(32)   ( 0:01/00:00:18)
*#形勢[774]▲３三桂成  △同桂  ▲１五歩  
  37 ３三桂成(45) ( 0:01/00:00:19)
*#形勢[644]△３三銀  ▲３四歩  △同銀  
  38 ３三銀(42)   ( 0:01/00:00:19)
*#形勢[793]▲５九金左  
  39 ５九金(69)   ( 0:01/00:00:20)
*#形勢[361]△９二飛  
  40 ９二飛(82)   ( 0:01/00:00:20)
*#形勢[843]▲３八金  
  41 ３八金(49)   ( 0:01/00:00:21)
*#形勢[376]△６三玉  
  42 ６三玉(52)   ( 0:01/00:00:21)
*#形勢[863]▲２八角  
  43 ２八角(55)   ( 0:01/00:00:22)
*#形勢[347]△７二銀  
  44 ７二銀(71)   ( 0:01/00:00:22)
*#形勢[768]▲３七金  
  45 ３七金(38)   ( 0:01/00:00:23)
*#形勢[287]△８二飛  
  46 ８二飛(92)   ( 0:01/00:00:23)
*#形勢[771]▲１五歩  
  47 １五歩(16)   ( 0:01/00:00:24)
*#形勢[266]△４二銀  
  48 ４二銀(33)   ( 0:01/00:00:24)
*#形勢[829]▲２六金  
  49 ２六金(37)   ( 0:01/00:00:25)
*#形勢[341]△７四歩  
  50 ７四歩(73)   ( 0:01/00:00:25)
*#形勢[816]▲１六香  
  51 １六香(18)   ( 0:01/00:00:26)
*#形勢[310]△５四歩  
  52 ５四歩(53)   ( 0:01/00:00:26)
*#形勢[809]▲４九玉  
  53 ４九玉(48)   ( 0:01/00:00:27)
*#形勢[297]△５三玉  
  54 ５三玉(63)   ( 0:01/00:00:27)
*#形勢[772]▲５八金  
  55 ５八金(59)   ( 0:01/00:00:28)
*#形勢[278]△７一金  
  56 ７一金(61)   ( 0:01/00:00:28)
*#形勢[789]▲６八金  
  57 ６八金(58)   ( 0:01/00:00:29)
*#形勢[273]△１二香  
  58 １二香(11)   ( 0:01/00:00:29)
*#形勢[762]▲５八玉  
  59 ５八玉(49)   ( 0:01/00:00:30)
*#形勢[349]△８四飛  
  60 ８四飛(82)   ( 0:01/00:00:30)
*#形勢[756]▲１九角  
  61 １九角(28)   ( 0:01/00:00:31)
*#形勢[272]△８三飛  
  62 ８三飛(84)   ( 0:01/00:00:31)
*#形勢[742]▲６九玉  
  63 ６九玉(58)   ( 0:01/00:00:32)
*#形勢[251]△６二金  
  64 ６二金(71)   ( 0:01/00:00:32)
*#形勢[744]▲２八角  
  65 ２八角(19)   ( 0:01/00:00:33)
*#形勢[304]△６三飛  
  66 ６三飛(83)   ( 0:01/00:00:33)
*#形勢[746]▲５八玉  
  67 ５八玉(69)   ( 0:01/00:00:34)
*#形勢[255]△３三銀  
  68 ３三銀(42)   ( 0:01/00:00:34)
*#形勢[708]▲１四歩  
  69 １四歩(15)   ( 0:01/00:00:35)
*#形勢[282]△４四銀  
  70 ４四銀(33)   ( 0:01/00:00:35)
*#形勢[1003]▲１三歩成  
  71 １三歩成(14) ( 0:01/00:00:36)
*#形勢[361]△１三桂  
  72 １三桂(21)   ( 0:01/00:00:36)
*#形勢[661]▲４九玉  
  73 ４九玉(58)   ( 0:01/00:00:37)
*#形勢[218]△６一金  
  74 ６一金(62)   ( 0:01/00:00:37)
*#形勢[664]▲１三香  △同香  
  75 １三香(16)   ( 0:01/00:00:38)
*#形勢[183]△１三香  
  76 １三香(12)   ( 0:01/00:00:38)
*#形勢[692]▲１七歩打  
  77 １七歩打     ( 0:01/00:00:39)
*#形勢[263]△１二歩打  
  78 １二歩打     ( 0:01/00:00:39)
*#形勢[781]▲１六歩  
  79 １六歩(17)   ( 0:01/00:00:40)
*#形勢[287]△７一金  
  80 ７一金(61)   ( 0:01/00:00:40)
*#形勢[794]▲５九玉  
  81 ５九玉(49)   ( 0:01/00:00:41)
*#形勢[303]△４五銀  
  82 ４五銀(44)   ( 0:01/00:00:41)
*#形勢[782]▲４八銀  
  83 ４八銀(39)   ( 0:01/00:00:42)
*#形勢[296]△７三飛  
  84 ７三飛(63)   ( 0:01/00:00:42)
*#形勢[789]▲３七銀  
  85 ３七銀(48)   ( 0:01/00:00:43)
*#形勢[335]△６二玉  
  86 ６二玉(53)   ( 0:01/00:00:43)
*#形勢[832]▲９六歩  
  87 ９六歩(97)   ( 0:01/00:00:44)
*#形勢[331]△８二金  
  88 ８二金(71)   ( 0:01/00:00:44)
*#形勢[819]▲３六銀  
  89 ３六銀(37)   ( 0:01/00:00:45)
*#形勢[532]△３六銀  ▲同金  
  90 ３六銀(45)   ( 0:01/00:00:45)
*#形勢[765]▲３六金  
  91 ３六金(26)   ( 0:01/00:00:46)
*#形勢[273]△１六香  
  92 １六香(13)   ( 0:01/00:00:46)
*#形勢[585]▲７九角  
  93 ７九角(88)   ( 0:01/00:00:47)
*#形勢[37]△１八香成  
  94 １八香成(16) ( 0:01/00:00:47)
*#形勢[342]▲６四角  
  95 ６四角(28)   ( 0:01/00:00:48)
*#形勢[83]△７五歩  
  96 ７五歩(74)   ( 0:01/00:00:48)
*#形勢[543]▲７五角  
  97 ７五角(64)   ( 0:01/00:00:49)
*#形勢[225]△６三飛  
  98 ６三飛(73)   ( 0:01/00:00:49)
*#形勢[780]▲４二角成  
  99 ４二角成(75) ( 0:01/00:00:50)
*#形勢[490]△２八成香  
 100 ２八成香(18) ( 0:01/00:00:50)
*#形勢[919]▲１五馬  
 101 １五馬(42)   ( 0:01/00:00:51)
*#形勢[442]△３三歩打  
 102 ３三歩打     ( 0:01/00:00:51)
*#形勢[952]▲４六歩  
 103 ４六歩(47)   ( 0:01/00:00:52)
*#形勢[421]△５三飛  
 104 ５三飛(63)   ( 0:01/00:00:52)
*#形勢[936]▲５六歩  
 105 ５六歩(57)   ( 0:01/00:00:53)
*#形勢[375]△２七成香  
 106 ２七成香(28) ( 0:01/00:00:53)
*#形勢[901]▲１九歩打  
 107 １九歩打     ( 0:01/00:00:54)
*#形勢[400]△５五歩  
 108 ５五歩(54)   ( 0:01/00:00:54)
*#形勢[907]▲７八金  
 109 ７八金(68)   ( 0:01/00:00:55)
*#形勢[197]△５六歩  
 110 ５六歩(55)   ( 0:01/00:00:55)
*#形勢[753]▲４八馬  
 111 ４八馬(15)   ( 0:01/00:00:56)
*#形勢[249]△５一玉  
 112 ５一玉(62)   ( 0:01/00:00:56)
*#形勢[747]▲６五歩  
 113 ６五歩(66)   ( 0:01/00:00:57)
*#形勢[272]△８三銀  
 114 ８三銀(72)   ( 0:01/00:00:57)
*#形勢[779]▲７七金  
 115 ７七金(78)   ( 0:01/00:00:58)
*#形勢[281]△５二飛  
 116 ５二飛(53)   ( 0:01/00:00:58)
*#形勢[851]▲５八玉  
 117 ５八玉(59)   ( 0:01/00:00:59)
*#形勢[-204]△５七歩成  
 118 ５七歩成(56) ( 0:01/00:00:59)
*#形勢[916]▲５七角  
 119 ５七角(79)   ( 0:01/00:01:00)
*#形勢[383]△６二飛  
 120 ６二飛(52)   ( 0:01/00:01:00)
*#形勢[863]▲４七玉  
 121 ４七玉(58)   ( 0:01/00:01:01)
*#形勢[559]△５二玉  
 122 ５二玉(51)   ( 0:01/00:01:01)
*#形勢[1014]▲５六銀  
 123 ５六銀(67)   ( 0:01/00:01:02)
*#形勢[506]△４三玉  
 124 ４三玉(52)   ( 0:01/00:01:02)
*#形勢[996]▲７九角  
 125 ７九角(57)   ( 0:01/00:01:03)
*#形勢[624]△４二歩打  
 126 ４二歩打     ( 0:01/00:01:03)
*#形勢[1099]▲５五歩打  
 127 ５五歩打     ( 0:01/00:01:04)
*#形勢[667]△９四歩  
 128 ９四歩(93)   ( 0:01/00:01:04)
*#形勢[1026]▲９七香  
 129 ９七香(98)   ( 0:01/00:01:05)
*#形勢[641]△３二玉  
 130 ３二玉(43)   ( 0:01/00:01:05)
*#形勢[1047]▲４九馬  
 131 ４九馬(48)   ( 0:01/00:01:06)
*#形勢[657]△２八飛打  
 132 ２八飛打     ( 0:01/00:01:06)
*#形勢[942]▲５九馬  
 133 ５九馬(49)   ( 0:01/00:01:07)
*#形勢[67]△９八飛成  
 134 ９八飛成(28) ( 0:01/00:01:07)
*#形勢[291]▲７八銀打  
 135 ７八銀打     ( 0:01/00:01:08)
*#形勢[-24]△７三金  
 136 ７三金(82)   ( 0:01/00:01:08)
*#形勢[472]▲４九馬  
 137 ４九馬(59)   ( 0:01/00:01:09)
*#形勢[-30]△１七成香  
 138 １七成香(27) ( 0:01/00:01:09)
*#形勢[399]▲３九馬  
 139 ３九馬(49)   ( 0:01/00:01:10)
*#形勢[135]△１五香打  
 140 １五香打     ( 0:01/00:01:10)
*#形勢[671]▲３七玉  
 141 ３七玉(47)   ( 0:01/00:01:11)
*#形勢[214]△４一玉  
 142 ４一玉(32)   ( 0:01/00:01:11)
*#形勢[592]▲６八角  
 143 ６八角(79)   ( 0:01/00:01:12)
*#形勢[244]△６一飛  
 144 ６一飛(62)   ( 0:01/00:01:12)
*#形勢[685]▲８六歩  
 145 ８六歩(87)   ( 0:01/00:01:13)
*#形勢[245]△７四金  
 146 ７四金(73)   ( 0:01/00:01:13)
*#形勢[642]▲３八馬  
 147 ３八馬(39)   ( 0:01/00:01:14)
*#形勢[201]△７二銀  
 148 ７二銀(83)   ( 0:01/00:01:14)
*#形勢[681]▲４五銀  
 149 ４五銀(56)   ( 0:01/00:01:15)
*#形勢[231]△１六香  
 150 １六香(15)   ( 0:01/00:01:15)
*#形勢[679]▲３四歩  
 151 ３四歩(35)   ( 0:01/00:01:16)
*#形勢[199]△６五飛  
 152 ６五飛(61)   ( 0:01/00:01:16)
*#形勢[750]▲３三歩成  
 153 ３三歩成(34) ( 0:01/00:01:17)
*#形勢[-1435]△６八飛成  
 154 ６八飛成(65) ( 0:01/00:01:17)
*#形勢[-550]▲７四馬  
 155 ７四馬(38)   ( 0:01/00:01:18)
*#形勢[-426]△３一玉  
 156 ３一玉(41)   ( 0:01/00:01:18)
*#形勢[-159]▲３二金打  
 157 ３二金打     ( 0:01/00:01:19)
 158 投了         ( 0:01/00:01:19)
まで157手で先手の勝ち

            ",
            'created_at' => new DateTime(),
            'updated_at' => new DateTime(),
        ]);
        
        DB::table('records')->insert([
            'user_id' => 4,
            'title' => 'ぴよ将棋レベル10同士対局',
            'first_player_name' => 'Lv10 ピヨ太(R450)',
            'second_player_name' => 'Lv10 ピヨ太(R450)',
            'remark' => '5分+5秒ルールでの対局',
            'record' => "
            # ----  ぴよ将棋 棋譜ファイル  ----
棋戦：ぴよ将棋 (5分+5秒)
戦型：
開始日時：2024/03/28 15:32:57
終了日時：2024/03/28 15:37:00
手合割：平手
先手：Lv10 ピヨ太(R450)
後手：Lv10 ピヨ太(R450)
手数----指手---------消費時間--
   1 ７六歩(77)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７六歩   ▲６八銀   
   2 ８四歩(83)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: △３四歩   △８四歩   △４二銀   △３二金   
   3 ２六歩(27)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: ▲２六歩   ▲６八銀   ▲５六歩   ▲７八銀   
*#定跡: ▲７八金   
   4 ８五歩(84)   ( 0:01/00:00:02)
*#定跡手
*#定跡: △３二金   △８五歩   △３四歩   
   5 ７七角(88)   ( 0:01/00:00:03)
*#定跡手
*#定跡: ▲７七角   ▲２五歩   
   6 ３四歩(33)   ( 0:01/00:00:03)
*#定跡手
*#定跡: △３四歩   
   7 ７八銀(79)   ( 0:01/00:00:04)
*#定跡手
*#定跡: ▲８八銀   ▲６六歩   ▲６八銀   ▲７八銀   
   8 ７七角成(22) ( 0:01/00:00:04)
*#定跡手
*#定跡: △３二金   △７七角成   
   9 ７七銀(78)   ( 0:01/00:00:05)
*#定跡手
*#定跡: ▲７七銀   
  10 ４二銀(31)   ( 0:01/00:00:05)
*#定跡手
*#定跡: △２二銀   △４二銀   △３二金   
  11 ３八銀(39)   ( 0:01/00:00:06)
*#定跡手
*#定跡: ▲３八銀   ▲４八銀   ▲３六歩   ▲４五角打   ▲７八金   
  12 ３三銀(42)   ( 0:01/00:00:06)
*#定跡手
*#定跡: △６二銀   △３三銀   
  13 ３六歩(37)   ( 0:01/00:00:07)
*#定跡手
*#定跡: ▲４六歩   ▲７八金   ▲３六歩   
  14 ６二銀(71)   ( 0:01/00:00:07)
*#定跡手
*#定跡: △３二金   △７四歩   △６二銀   
  15 ３七桂(29)   ( 0:01/00:00:08)
*#定跡手
*#定跡: ▲４六歩   ▲３七銀   ▲３七桂   
  16 ７四歩(73)   ( 0:01/00:00:08)
*#定跡手
*#定跡: △７四歩   
  17 ６八玉(59)   ( 0:01/00:00:09)
*#定跡手
*#定跡: ▲４五桂   ▲６八玉   
*#形勢[166]△８四飛  ▲４五桂  △４四銀  ▲１五角打  △４二角打  ▲同角成  △同金  
  18 ８四飛(82)   ( 0:01/00:00:09)
*#定跡: △７三桂   
*#形勢[243]▲６六角打  △９四飛  ▲９六歩  △７三角打  ▲９五歩  △８四飛  ▲同角  △同角  
  19 ６六角打     ( 0:01/00:00:10)
*#形勢[188]△９四飛  ▲９六歩  △４四角打  ▲４五桂  △６六角  ▲同銀  △４四銀  ▲１五角打  △２四角打  
  20 ９四飛(84)   ( 0:01/00:00:10)
*#形勢[226]▲９六歩  △７五歩  ▲同歩  △５四飛  ▲７六銀  △パス  
  21 ９六歩(97)   ( 0:01/00:00:11)
*#形勢[247]△７五歩  ▲同角  △４四飛  ▲５六歩  
  22 ７五歩(74)   ( 0:01/00:00:11)
*#形勢[207]▲２五桂  △４四銀  ▲７五歩  △パス  
  23 ２五桂(37)   ( 0:01/00:00:12)
*#形勢[104]△４四銀  ▲７五角  △２四歩  ▲１八飛  △２五歩  ▲同歩  
  24 ４四銀(33)   ( 0:01/00:00:12)
*#形勢[-396]▲９五歩  △５四飛  ▲９四歩  △７六歩  ▲同銀  △９四歩  
  25 ９五歩(96)   ( 0:01/00:00:13)
*#形勢[-180]△５四飛  ▲５八玉  △２四歩  ▲７五角  △２五歩  ▲同歩  
  26 ５四飛(94)   ( 0:01/00:00:13)
*#形勢[-405]▲７五角  △２四歩  ▲１三桂  △同香  ▲６六銀  △２五歩  ▲同歩  
  27 ７五角(66)   ( 0:01/00:00:14)
*#形勢[-557]△２四歩  ▲１三桂成  △同桂  ▲５八玉  
  28 ２四歩(23)   ( 0:01/00:00:14)
*#形勢[-584]▲９六香  △２五歩  ▲同歩  △９四歩  
  29 ９六香(99)   ( 0:01/00:00:15)
*#形勢[-967]△２五歩  ▲同歩  △４五角打  
  30 ２五歩(24)   ( 0:01/00:00:15)
*#形勢[-818]▲７八金  
  31 ７八金(69)   ( 0:01/00:00:16)
*#形勢[-1312]△６五桂打  ▲７九玉  △７七桂成  ▲同桂  
  32 ６五桂打     ( 0:01/00:00:16)
*#形勢[-741]▲６六銀  △９二角打  ▲２五歩  
  33 ６六銀(77)   ( 0:01/00:00:17)
*#形勢[-882]△６四歩  ▲５六歩  △２四角打  
  34 ６四歩(63)   ( 0:01/00:00:17)
*#形勢[-654]▲８六歩  
  35 ８六歩(87)   ( 0:01/00:00:18)
*#形勢[-1376]△５七飛成  
  36 ５七飛成(54) ( 0:01/00:00:18)
*#形勢[798]▲５七銀  △同桂  ▲同角  
  37 ５七銀(66)   ( 0:01/00:00:19)
*#形勢[662]△９八角打  ▲２二飛打  △７六角成  ▲２一飛成  
  38 ９八角打     ( 0:01/00:00:19)
*#形勢[959]▲８五歩  
  39 ８五歩(86)   ( 0:01/00:00:20)
*#形勢[18]△８九角成  ▲２五歩  △５七桂成  ▲同角  
  40 ８九角成(98) ( 0:01/00:00:20)
*#形勢[190]▲６六銀  
  41 ６六銀(57)   ( 0:01/00:00:21)
*#形勢[-263]△５六桂打  ▲６九玉  
  42 ５六桂打     ( 0:01/00:00:21)
*#形勢[-145]▲６九玉  
  43 ６九玉(68)   ( 0:01/00:00:22)
*#形勢[-255]△５二玉  
  44 ５二玉(51)   ( 0:01/00:00:22)
*#形勢[-233]▲２二飛打  
  45 ２二飛打     ( 0:01/00:00:23)
*#形勢[461]△４二金  
  46 ４二金(41)   ( 0:01/00:00:23)
*#形勢[281]▲２一飛成  
  47 ２一飛成(22) ( 0:01/00:00:24)
*#形勢[545]△７七歩打  
  48 ７七歩打     ( 0:01/00:00:24)
*#形勢[572]▲７七銀  
  49 ７七銀(66)   ( 0:01/00:00:25)
*#形勢[-313]△７七桂  ▲同金  
  50 ７七桂(65)   ( 0:01/00:00:25)
*#形勢[-200]▲７七金  
  51 ７七金(78)   ( 0:01/00:00:26)
*#形勢[-967]△６八銀打  
  52 ６八銀打     ( 0:01/00:00:26)
  53 ５八玉(69)   ( 0:01/00:00:27)
*#1手のみ
*#形勢[-87]△７七銀  
  54 ７七銀(68)   ( 0:01/00:00:27)
*#形勢[-444]▲１一龍  
  55 １一龍(21)   ( 0:01/00:00:28)
*#形勢[-555]△２六歩  ▲７四桂打  
  56 ２六歩(25)   ( 0:01/00:00:28)
*#形勢[-441]▲５四歩打  △６八桂成  
  57 ５四歩打     ( 0:01/00:00:29)
*#形勢[-471]△６八桂成  
  58 ６八桂成(56) ( 0:01/00:00:29)
*#形勢[549]▲４八玉  
  59 ４八玉(58)   ( 0:01/00:00:30)
*#形勢[133]△６七馬  
  60 ６七馬(89)   ( 0:01/00:00:30)
*#形勢[-151]▲３七玉  
  61 ３七玉(48)   ( 0:01/00:00:31)
*#形勢[-51]△５四歩  
  62 ５四歩(53)   ( 0:01/00:00:31)
*#形勢[-97]▲６四角  
  63 ６四角(75)   ( 0:01/00:00:32)
*#形勢[-162]△２七金打  
  64 ２七金打     ( 0:01/00:00:32)
*#形勢[1037]▲２七銀  
  65 ２七銀(38)   ( 0:01/00:00:33)
*#形勢[215]△２七歩成  ▲同玉  
  66 ２七歩成(26) ( 0:01/00:00:33)
*#形勢[423]▲２七玉  
  67 ２七玉(37)   ( 0:01/00:00:34)
*#形勢[-54]△４九馬  
  68 ４九馬(67)   ( 0:01/00:00:34)
*#形勢[-227]▲１八玉  
  69 １八玉(27)   ( 0:01/00:00:35)
*#形勢[-1102]△２七金打  
  70 ２七金打     ( 0:01/00:00:35)
*#形勢[557]▲２七飛  
  71 ２七飛(28)   ( 0:01/00:00:36)
*#形勢[913]△２七馬  ▲同玉  
  72 ２七馬(49)   ( 0:01/00:00:36)
*#形勢[1236]▲２七玉  
  73 ２七玉(18)   ( 0:01/00:00:37)
*#形勢[1017]△２四飛打  
  74 ２四飛打     ( 0:01/00:00:37)
*#形勢[1590]▲２六歩打  
  75 ２六歩打     ( 0:01/00:00:38)
*#形勢[1649]△２一歩打  
  76 ２一歩打     ( 0:01/00:00:38)
*#形勢[1872]▲７五角打  
  77 ７五角打     ( 0:01/00:00:39)
*#形勢[1550]△５三銀上  
  78 ５三銀(62)   ( 0:01/00:00:39)
*#形勢[3170]▲５三角成  
  79 ５三角成(64) ( 0:01/00:00:40)
*#形勢[860]△５三金  
  80 ５三金(42)   ( 0:01/00:00:40)
*#形勢[1140]▲６五桂打  
  81 ６五桂打     ( 0:01/00:00:41)
*#形勢[1047]△６四角打  
  82 ６四角打     ( 0:01/00:00:41)
*#形勢[1116]▲６四角  △同金  
  83 ６四角(75)   ( 0:01/00:00:42)
*#形勢[1455]△６四金  
  84 ６四金(53)   ( 0:01/00:00:42)
*#形勢[1624]▲５三銀打  
  85 ５三銀打     ( 0:01/00:00:43)
*#形勢[472]△５三銀  
  86 ５三銀(44)   ( 0:01/00:00:43)
*#形勢[314]▲５三桂  △同玉  
  87 ５三桂(65)   ( 0:01/00:00:44)
*#形勢[148]△５三玉  
  88 ５三玉(52)   ( 0:01/00:00:44)
*#形勢[236]▲１三龍  
  89 １三龍(11)   ( 0:01/00:00:45)
*#形勢[-46]△４九角打  
  90 ４九角打     ( 0:01/00:00:45)
*#形勢[-118]▲３八銀打  
  91 ３八銀打     ( 0:01/00:00:46)
*#形勢[351]△３八角成  ▲同玉  
  92 ３八角成(49) ( 0:01/00:00:46)
*#形勢[328]▲３八玉  
  93 ３八玉(27)   ( 0:01/00:00:47)
*#形勢[28]△２六飛  ▲４五桂打  
  94 ２六飛(24)   ( 0:01/00:00:47)
*#形勢[39]▲４五桂打  
  95 ４五桂打     ( 0:01/00:00:48)
*#形勢[1083]△６三玉  
  96 ６三玉(53)   ( 0:01/00:00:48)
*#形勢[587]▲４三龍  
  97 ４三龍(13)   ( 0:01/00:00:49)
*#形勢[1133]△７四玉  
  98 ７四玉(63)   ( 0:01/00:00:49)
*#形勢[1834]▲７五金打  
  99 ７五金打     ( 0:01/00:00:50)
 100 ７五金(64)   ( 0:01/00:00:50)
*#1手のみ
*#形勢[-109]▲８三角打  
 101 ８三角打     ( 0:01/00:00:51)
*#形勢[-533]△８五玉  
 102 ８五玉(74)   ( 0:01/00:00:51)
*#形勢[-777]▲７五歩  △２七銀打  
 103 ７五歩(76)   ( 0:01/00:00:52)
*#形勢[-1353]△３六飛  ▲３七歩打  
 104 ３六飛(26)   ( 0:01/00:00:52)
*#形勢[-1315]▲３七歩打  
 105 ３七歩打     ( 0:01/00:00:53)
*#形勢[-1288]△４九銀打  ▲同玉  
 106 ４九銀打     ( 0:01/00:00:53)
*#形勢[-999]▲４九玉  
 107 ４九玉(38)   ( 0:01/00:00:54)
*#形勢[-581]△５八金打  
 108 ５八金打     ( 0:01/00:00:54)
*#形勢[-380]▲３八玉  
 109 ３八玉(49)   ( 0:01/00:00:55)
*#形勢[164]△４八金  ▲同玉  
 110 ４八金(58)   ( 0:01/00:00:55)
*#形勢[189]▲４八玉  
 111 ４八玉(38)   ( 0:01/00:00:56)
*#形勢[561]△５七銀打  ▲３八玉  
 112 ５七銀打     ( 0:01/00:00:56)
*#形勢[421]▲３八玉  
 113 ３八玉(48)   ( 0:01/00:00:57)
*#形勢[1251]△２六桂打  
 114 ２六桂打     ( 0:01/00:00:57)
*#形勢[1200]▲２七玉  
 115 ２七玉(38)   ( 0:01/00:00:58)
*#形勢[1546]△９六玉  
 116 ９六玉(85)   ( 0:01/00:00:58)
*#形勢[3054]▲３六歩  
 117 ３六歩(37)   ( 0:01/00:00:59)
*#形勢[2910]△３八銀打  
 118 ３八銀打     ( 0:01/00:00:59)
*#形勢[4498]▲２六玉  
 119 ２六玉(27)   ( 0:01/00:01:00)
*#形勢[4225]△２二香打  
 120 ２二香打     ( 0:01/00:01:00)
*#形勢[4801]▲２三歩打  
 121 ２三歩打     ( 0:01/00:01:01)
*#形勢[4703]△８七玉  
 122 ８七玉(96)   ( 0:01/00:01:01)
*#形勢[5474]▲２二歩成  △２七銀成  
 123 ２二歩成(23) ( 0:01/00:01:02)
*#形勢[5249]△２二歩  
 124 ２二歩(21)   ( 0:01/00:01:02)
*#形勢[5604]▲６一角成  
 125 ６一角成(83) ( 0:01/00:01:03)
*#形勢[5319]△８八玉  
 126 ８八玉(87)   ( 0:01/00:01:03)
*#形勢[6029]▲２五玉  
 127 ２五玉(26)   ( 0:01/00:01:04)
*#形勢[5939]△４七銀  
 128 ４七銀(38)   ( 0:01/00:01:04)
*#形勢[6207]▲３四玉  
 129 ３四玉(25)   ( 0:01/00:01:05)
*#形勢[6268]△７八歩打  
 130 ７八歩打     ( 0:01/00:01:05)
*#形勢[6482]▲３三桂成  
 131 ３三桂成(45) ( 0:01/00:01:06)
*#形勢[6428]△７九歩成  
 132 ７九歩成(78) ( 0:01/00:01:06)
*#形勢[6713]▲４七龍  
 133 ４七龍(43)   ( 0:01/00:01:07)
*#形勢[6772]△３二歩打  ▲同成桂  
 134 ３二歩打     ( 0:01/00:01:07)
*#形勢[6951]▲５七龍  
 135 ５七龍(47)   ( 0:01/00:01:08)
*#形勢[7002]△３三歩  ▲同玉  
 136 ３三歩(32)   ( 0:01/00:01:08)
*#形勢[6945]▲３三玉  
 137 ３三玉(34)   ( 0:01/00:01:09)
*#形勢[6554]△３一歩打  
 138 ３一歩打     ( 0:01/00:01:09)
*#形勢[7438]▲４二玉  
 139 ４二玉(33)   ( 0:01/00:01:10)
*#形勢[7249]△６七歩打  
 140 ６七歩打     ( 0:01/00:01:10)
*#形勢[7544]▲４三馬  
 141 ４三馬(61)   ( 0:01/00:01:11)
*#形勢[7316]△７八歩打  
 142 ７八歩打     ( 0:01/00:01:11)
*#形勢[7742]▲３三金打  
 143 ３三金打     ( 0:01/00:01:12)
*#形勢[7387]△９四歩  
 144 ９四歩(93)   ( 0:01/00:01:12)
*#形勢[7650]▲５二銀打  
 145 ５二銀打     ( 0:01/00:01:13)
*#形勢[7385]△９三桂  
 146 ９三桂(81)   ( 0:01/00:01:13)
*#形勢[7744]▲２二金  
 147 ２二金(33)   ( 0:01/00:01:14)
*#形勢[7207]△９五歩  
 148 ９五歩(94)   ( 0:01/00:01:14)
*#形勢[7570]▲９九歩打  △同玉  
 149 ９九歩打     ( 0:01/00:01:15)
*#形勢[7249]△９九玉  
 150 ９九玉(88)   ( 0:01/00:01:15)
*#形勢[7552]▲５三歩打  
 151 ５三歩打     ( 0:01/00:01:16)
*#形勢[7343]△１五歩打  
 152 １五歩打     ( 0:01/00:01:16)
*#形勢[7746]▲９七飛打  
 153 ９七飛打     ( 0:01/00:01:17)
*#形勢[7929]△８八玉  
 154 ８八玉(99)   ( 0:01/00:01:17)
*#形勢[8952]▲８七金打  
 155 ８七金打     ( 0:01/00:01:18)
 156 ８九玉(88)   ( 0:01/00:01:18)
*#1手のみ
*#形勢[29999]▲９九金打  
 157 ９九金打     ( 0:01/00:01:19)
 158 投了         ( 0:01/00:01:19)
まで157手で先手の勝ち

            ",
            'created_at' => new DateTime(),
            'updated_at' => new DateTime(),
        ]);
        
        DB::table('records')->insert([
            'user_id' => 5,
            'title' => 'ぴよ将棋レベル15同士対局',
            'first_player_name' => 'Lv15 ひよん(R780)',
            'second_player_name' => 'Lv15 ひよん(R780)',
            'remark' => '5分+5秒ルールでの対局',
            'record' => "
            # ----  ぴよ将棋 棋譜ファイル  ----
棋戦：ぴよ将棋 (5分+5秒)
戦型：
開始日時：2024/03/28 15:37:13
終了日時：2024/03/28 21:03:49
手合割：平手
先手：Lv15 ひよん(R780)
後手：Lv15 ひよん(R780)
手数----指手---------消費時間--
   1 ７六歩(77)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７六歩   ▲６八銀   
   2 ３四歩(33)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: △３四歩   △８四歩   △４二銀   △３二金   
   3 ２六歩(27)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７五歩   ▲６六歩   
   4 ３二金(41)   ( 0:01/00:00:02)
*#定跡手
*#定跡: △８四歩   △４四歩   △５四歩   △３二金   
   5 ２五歩(26)   ( 0:01/00:00:03)
*#定跡手
*#定跡: ▲７八金   ▲２五歩   
   6 ８四歩(83)   ( 0:01/00:00:03)
*#定跡手
*#定跡: △８八角成   △８四歩   △３三角   
   7 ７八金(69)   ( 0:01/00:00:04)
*#定跡手
*#定跡: ▲５八玉   ▲７八金   
   8 ８五歩(84)   ( 0:01/00:00:04)
*#定跡手
*#定跡: △８五歩   
   9 ２四歩(25)   ( 0:01/00:00:05)
*#定跡手
*#定跡: ▲２四歩   ▲５六歩   
  10 ２四歩(23)   ( 0:01/00:00:05)
*#定跡手
*#定跡: △２四歩   
  11 ２四飛(28)   ( 0:01/00:00:06)
*#定跡手
*#定跡: ▲２四飛   
  12 ８六歩(85)   ( 0:01/00:00:06)
*#定跡手
*#定跡: △８六歩   
  13 ８六歩(87)   ( 0:01/00:00:07)
*#定跡手
*#定跡: ▲８六歩   
  14 ８六飛(82)   ( 0:01/00:00:07)
*#定跡手
*#定跡: △８六飛   
  15 ３四飛(24)   ( 0:01/00:00:08)
*#定跡手
*#定跡: ▲３四飛   
  16 ３三角(22)   ( 0:01/00:00:08)
*#定跡手
*#定跡: △３三角   
*#形勢[158]▲８七歩打  △８五飛  ▲３八銀  △２二銀  ▲３三角成  △同金  ▲３六飛  
  17 ８七歩打     ( 0:01/00:00:09)
*#定跡: ▲５八玉   
*#形勢[-55]△７六飛  ▲３三角成  △同金  ▲３六飛  △同飛  ▲同歩  
  18 ７六飛(86)   ( 0:01/00:00:09)
*#形勢[-139]▲３三角成  △同金  ▲１五角打  △４二銀  ▲３六飛  △同飛  ▲同歩  △２七角打  ▲３八銀  
  19 ３三角成(88) ( 0:01/00:00:10)
*#形勢[-106]△３三金  ▲１五角打  △４二銀  ▲３六飛  △同飛  ▲同歩  △３二金  ▲５八玉  
  20 ３三金(32)   ( 0:01/00:00:10)
*#形勢[-267]▲３六飛  △同飛  ▲同歩  △２七飛打  ▲３八銀  △２八飛成  
  21 ３六飛(34)   ( 0:01/00:00:11)
*#形勢[-78]△３六飛  ▲同歩  △２四飛打  ▲２八歩打  △７二銀  
  22 ３六飛(76)   ( 0:01/00:00:11)
*#形勢[-89]▲３六歩  △２四飛打  ▲２八歩打  △５五角打  ▲７七角打  △２八角成  ▲同銀  △同飛成  
  23 ３六歩(37)   ( 0:01/00:00:12)
*#形勢[-16]△２二飛打  ▲２八歩打  △４二銀  ▲５八玉  
  24 ２二飛打     ( 0:01/00:00:12)
*#形勢[-103]▲２八歩打  △２七歩打  ▲５五角打  △４四金  ▲同角  △同歩  
  25 ２八歩打     ( 0:01/00:00:13)
*#形勢[-36]△２七歩打  ▲５五角打  △４四金  ▲３七角  △５四角打  ▲３八金  △２八歩成  ▲同銀  △８二銀  
  26 ２七歩打     ( 0:01/00:00:13)
*#形勢[-54]▲４六角打  △８二銀  ▲３八金  △２八歩成  ▲同銀  △パス  
  27 ４六角打     ( 0:01/00:00:14)
*#形勢[8]△８二銀  ▲３八金  △２八歩成  ▲同銀  △９四歩  ▲６八玉  
  28 ８二銀(71)   ( 0:01/00:00:14)
*#形勢[-29]▲３八金  △２八歩成  ▲同銀  △４四歩  ▲３七桂  △２六歩打  
  29 ３八金(49)   ( 0:01/00:00:15)
*#形勢[59]△２八歩成  ▲同銀  △２六歩打  ▲８八銀  
  30 ２八歩成(27) ( 0:01/00:00:15)
*#形勢[28]▲２八銀  △４四歩  ▲５八玉  △２六歩打  ▲８八銀  
  31 ２八銀(39)   ( 0:01/00:00:16)
*#形勢[11]△４二銀  ▲８八銀  △６二玉  ▲８六歩  △４四歩  ▲５八玉  △４五歩  
  32 ４二銀(31)   ( 0:01/00:00:16)
*#形勢[-6]▲６八銀  △６二玉  ▲７七銀  △２六歩打  ▲３七桂  
  33 ６八銀(79)   ( 0:01/00:00:17)
*#形勢[-25]△２六歩打  ▲７七桂  △５二金  
  34 ２六歩打     ( 0:01/00:00:17)
*#形勢[-46]▲７七桂  △４四金  ▲３七桂  
  35 ７七桂(89)   ( 0:01/00:00:18)
*#形勢[-122]△４四歩  ▲６六歩  △８九角打  ▲６七銀  △４五歩  ▲３五角  △３四金  
  36 ４四歩(43)   ( 0:01/00:00:18)
*#形勢[-155]▲５六歩  △６二玉  ▲３七角  
  37 ５六歩(57)   ( 0:01/00:00:19)
*#形勢[-187]△６二玉  ▲２三歩打  △同金  ▲４一飛打  △５一金  ▲パス  △４一金  
  38 ６二玉(51)   ( 0:01/00:00:19)
*#形勢[-19]▲５七角  △３一銀  
  39 ５七角(46)   ( 0:01/00:00:20)
*#形勢[-168]△７二玉  ▲９六歩  △８三歩打  
  40 ７二玉(62)   ( 0:01/00:00:20)
*#形勢[-243]▲５八玉  △２七歩成  ▲同銀  △同飛成  ▲同金  
  41 ５八玉(59)   ( 0:01/00:00:21)
*#形勢[-99]△９四歩  ▲３七桂  △８三銀  
  42 ９四歩(93)   ( 0:01/00:00:21)
*#形勢[-37]▲８六歩  △８三銀  ▲３七桂  
  43 ８六歩(87)   ( 0:01/00:00:22)
*#形勢[-4]△８三銀  ▲９六歩  △８四歩打  ▲９五歩  
  44 ８三銀(82)   ( 0:01/00:00:22)
*#形勢[-69]▲９六歩  △２七歩成  ▲同銀  △同飛成  ▲同金  
  45 ９六歩(97)   ( 0:01/00:00:23)
*#形勢[-137]△８四歩打  ▲８五歩  △２七歩成  ▲同銀  △同飛成  
  46 ８四歩打     ( 0:01/00:00:23)
*#形勢[-186]▲８五歩  △２七歩成  ▲同銀  △同飛成  ▲同金  △３八角打  
  47 ８五歩(86)   ( 0:01/00:00:24)
*#形勢[55]△８五歩  ▲８四歩打  △７四銀  
  48 ８五歩(84)   ( 0:01/00:00:24)
*#形勢[-80]▲８四歩打  △７四銀  ▲７九金  
  49 ８四歩打     ( 0:01/00:00:25)
*#形勢[-212]△７四銀  ▲７九金  △４三銀  
  50 ７四銀(83)   ( 0:01/00:00:25)
*#形勢[-185]▲７九金  △８六歩  
  51 ７九金(78)   ( 0:01/00:00:26)
*#形勢[-119]△７六角打  ▲８三歩成  △同玉  
  52 ７六角打     ( 0:01/00:00:26)
*#形勢[-216]▲８三歩成  △同玉  ▲８四飛打  △７二玉  
  53 ８三歩成(84) ( 0:01/00:00:27)
*#形勢[-287]△８三銀  ▲７八金  
  54 ８三銀(74)   ( 0:01/00:00:27)
*#形勢[-201]▲７八金  △２七歩成  ▲同銀  △同飛成  ▲同金  △６七角成  
  55 ７八金(79)   ( 0:01/00:00:28)
*#形勢[-293]△８六歩  ▲８四歩打  △７四銀  
  56 ８六歩(85)   ( 0:01/00:00:28)
*#形勢[-435]▲８四歩打  △７四銀  ▲８三歩成  △同銀  
  57 ８四歩打     ( 0:01/00:00:29)
*#形勢[-708]△７四銀  ▲８三歩成  △同銀  ▲３七銀  
  58 ７四銀(83)   ( 0:01/00:00:29)
*#形勢[-813]▲８三歩成  △同銀  ▲８九飛打  
  59 ８三歩成(84) ( 0:01/00:00:30)
*#形勢[-827]△８三銀  ▲８九飛打  △３二角  
  60 ８三銀(74)   ( 0:01/00:00:30)
*#形勢[-1202]▲９七飛打  △１四歩  
  61 ９七飛打     ( 0:01/00:00:31)
*#形勢[-1265]△１四歩  ▲３七桂  △５四角  ▲９五歩  
  62 １四歩(13)   ( 0:01/00:00:31)
*#形勢[-1577]▲３五歩  △２七歩成  ▲同金  △同飛成  ▲同銀  
  63 ３五歩(36)   ( 0:01/00:00:32)
*#形勢[-1343]△５四角  ▲３四歩  △同金  ▲９五歩  
  64 ５四角(76)   ( 0:01/00:00:32)
*#形勢[-1540]▲３四歩  △同金  ▲９五歩  △２七歩成  ▲同銀  
  65 ３四歩(35)   ( 0:01/00:00:33)
*#形勢[-1556]△３四金  ▲５五歩  △２七歩成  ▲５四歩  △３八と  
  66 ３四金(33)   ( 0:01/00:00:33)
*#形勢[-1795]▲５五歩  △２七歩成  ▲５四歩  △３八と  ▲７五角  
  67 ５五歩(56)   ( 0:01/00:00:34)
*#形勢[-2200]△２七歩成  ▲５四歩  △３八と  ▲５三歩成  △２八飛成  
  68 ２七歩成(26) ( 0:01/00:00:34)
*#形勢[-2312]▲５四歩  △３八と  ▲５三歩成  △２八飛成  ▲５二角打  
  69 ５四歩(55)   ( 0:01/00:00:35)
*#形勢[-2763]△３八と  ▲５三歩成  △２八飛成  ▲４二と  △８七歩成  
  70 ３八と(27)   ( 0:01/00:00:35)
*#形勢[-2570]▲５三歩成  △２八飛成  ▲６三と  △同玉  
  71 ５三歩成(54) ( 0:01/00:00:36)
*#形勢[-2629]△２八飛成  ▲４二と  △２九龍  ▲３九歩打  △８七歩成  
  72 ２八飛成(22) ( 0:01/00:00:36)
*#形勢[-2507]▲４二と  △２九龍  ▲３九歩打  △５六歩打  ▲６九玉  
  73 ４二と(53)   ( 0:01/00:00:37)
*#形勢[-2741]△２九龍  ▲３九歩打  △５六歩打  ▲７五角  
  74 ２九龍(28)   ( 0:01/00:00:37)
*#形勢[-2553]▲３九歩打  △５六歩打  ▲７五角  △３九龍  
  75 ３九歩打     ( 0:01/00:00:38)
*#形勢[-2485]△４五桂打  ▲６六角  △５七歩打  ▲６九玉  
  76 ４五桂打     ( 0:01/00:00:38)
*#形勢[-2319]▲７五角  △５七歩打  ▲６九玉  
  77 ７五角(57)   ( 0:01/00:00:39)
*#形勢[-2724]△５七歩打  ▲同銀  △３九龍  ▲４三角打  
  78 ５七歩打     ( 0:01/00:00:39)
*#形勢[-2466]▲５七銀  △３九龍  ▲４三角打  △６九銀打  ▲６八玉  
  79 ５七銀(68)   ( 0:01/00:00:40)
*#形勢[-2937]△３九龍  ▲４三角打  △６九銀打  ▲６八玉  △８七歩成  
  80 ３九龍(29)   ( 0:01/00:00:40)
*#形勢[-2569]▲４三角打  △６九銀打  ▲６八玉  △５八金打  ▲７九玉  
  81 ４三角打     ( 0:01/00:00:41)
*#形勢[-2776]△６九銀打  ▲６八玉  △５八金打  ▲７九玉  △８七歩成  
  82 ６九銀打     ( 0:01/00:00:41)
  83 ６八玉(58)   ( 0:01/00:00:42)
*#1手のみ
*#形勢[-2654]△５八金打  ▲７九玉  △７八銀成  ▲同玉  
  84 ５八金打     ( 0:01/00:00:42)
  85 ７九玉(68)   ( 0:01/00:00:43)
*#1手のみ
*#形勢[-3401]△７八銀  ▲同玉  △６九龍  ▲８八玉  △７八金打  ▲９八玉  
  86 ７八銀(69)   ( 0:01/00:00:43)
  87 投了         ( 0:01/00:00:44)
まで86手で後手の勝ち

            ",
            'created_at' => new DateTime(),
            'updated_at' => new DateTime(),
        ]);
        
        DB::table('records')->insert([
            'user_id' => 6,
            'title' => 'ぴよ将棋レベル20同士対局',
            'first_player_name' => 'Lv20 ピヨ馬(R1220)',
            'second_player_name' => 'Lv20 ピヨ馬(R1220)',
            'remark' => '5分+5秒ルールでの対局',
            'record' => "
            # ----  ぴよ将棋 棋譜ファイル  ----
棋戦：ぴよ将棋 (5分+5秒)
戦型：
開始日時：2024/03/28 21:06:04
終了日時：2024/03/28 21:09:11
手合割：平手
先手：Lv20 ピヨ馬(R1220)
後手：Lv20 ピヨ馬(R1220)
手数----指手---------消費時間--
   1 ７六歩(77)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７六歩   ▲６八銀   
   2 ８四歩(83)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: △３四歩   △８四歩   △４二銀   △３二金   
   3 ２六歩(27)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: ▲２六歩   ▲６八銀   ▲５六歩   ▲７八銀   
*#定跡: ▲７八金   
   4 ３四歩(33)   ( 0:01/00:00:02)
*#定跡手
*#定跡: △３二金   △８五歩   △３四歩   
   5 ２五歩(26)   ( 0:01/00:00:03)
*#定跡手
*#定跡: ▲２五歩   ▲７八金   
   6 ３二金(41)   ( 0:01/00:00:03)
*#定跡手
*#定跡: △８五歩   △３二金   
   7 ７八金(69)   ( 0:01/00:00:04)
*#定跡手
*#定跡: ▲５八玉   ▲７八金   
   8 ８五歩(84)   ( 0:01/00:00:04)
*#定跡手
*#定跡: △８五歩   
   9 ２四歩(25)   ( 0:01/00:00:05)
*#定跡手
*#定跡: ▲２四歩   ▲５六歩   
  10 ２四歩(23)   ( 0:01/00:00:05)
*#定跡手
*#定跡: △２四歩   
  11 ２四飛(28)   ( 0:01/00:00:06)
*#定跡手
*#定跡: ▲２四飛   
  12 ８六歩(85)   ( 0:01/00:00:06)
*#定跡手
*#定跡: △８六歩   
  13 ８六歩(87)   ( 0:01/00:00:07)
*#定跡手
*#定跡: ▲８六歩   
  14 ８六飛(82)   ( 0:01/00:00:07)
*#定跡手
*#定跡: △８六飛   
  15 ３四飛(24)   ( 0:01/00:00:08)
*#定跡手
*#定跡: ▲３四飛   
  16 ３三角(22)   ( 0:01/00:00:08)
*#定跡手
*#定跡: △３三角   
*#形勢[149]▲８七歩打  △８五飛  ▲３三角成  △同金  ▲３六飛  △２五飛  ▲２八歩打  △３五歩打  
  17 ８七歩打     ( 0:01/00:00:09)
*#定跡: ▲５八玉   
*#形勢[57]△８五飛  ▲３八銀  △４二銀  ▲２四歩打  △２八歩打  ▲８六歩  △同飛  ▲３三角成  △同桂  
  18 ８五飛(86)   ( 0:01/00:00:09)
*#形勢[89]▲３八銀  △４二銀  ▲６八銀  △８八角成  ▲同金  △３三銀  ▲３六飛  △８六歩打  ▲同歩  △同飛  
  19 ３八銀(39)   ( 0:01/00:00:10)
*#形勢[91]△４二銀  ▲５八玉  △２八歩打  ▲２二歩打  △同金  ▲３三角成  △同金  ▲３六飛  △２九歩成  ▲同銀  
  20 ４二銀(31)   ( 0:01/00:00:10)
*#形勢[24]▲１六歩  △２五飛  ▲８四飛  △８八角成  ▲同銀  △９五角打  ▲８六飛  △同角  ▲同歩  △２八飛成  
  21 １六歩(17)   ( 0:01/00:00:11)
*#形勢[16]△２五飛  ▲２七歩打  △６二玉  ▲３三角成  △同金  ▲３六飛  △２八歩打  ▲１七桂  △２二飛  
  22 ２五飛(85)   ( 0:01/00:00:11)
*#形勢[88]▲２七歩打  △６二玉  ▲５八玉  △２六歩打  ▲同歩  △同飛  ▲８四飛  △８八角成  ▲同銀  
  23 ２七歩打     ( 0:01/00:00:12)
*#形勢[-76]△６二玉  ▲９六歩  △８八角成  ▲同銀  △３三銀  ▲８四飛  △８二歩打  ▲５八玉  
  24 ６二玉(51)   ( 0:01/00:00:12)
*#形勢[-256]▲１七桂  △２二飛  ▲５八玉  △８三歩打  ▲３三角成  △同桂  ▲３五飛  
  25 １七桂(29)   ( 0:01/00:00:13)
*#形勢[-272]△２二飛  ▲５八玉  △８三歩打  ▲３五飛  △８八角成  ▲同銀  △３三銀  ▲８五飛  
  26 ２二飛(25)   ( 0:01/00:00:13)
*#形勢[-289]▲３五飛  △８八角成  ▲同銀  △２八角打  ▲８五飛  △８二歩打  ▲１八香  △パス  
  27 ３五飛(34)   ( 0:01/00:00:14)
*#形勢[-515]△８八角成  ▲同銀  △２八角打  ▲５五角打  △１九角成  ▲２二角成  △同金  ▲６九玉  
  28 ８八角成(33) ( 0:01/00:00:14)
*#形勢[-590]▲８八銀  △２八角打  ▲５五角打  △３三銀  ▲３六歩  △３七歩打  ▲同角  △同角成  ▲同銀  △２七飛成  ▲４八銀  △３七歩打  
  29 ８八銀(79)   ( 0:01/00:00:15)
*#形勢[-505]△２八角打  ▲７七角打  △１九角成  ▲２二角成  △同金  ▲６八玉  △２八馬  ▲２五飛  △２三歩打  ▲８五飛  △８二香打  ▲２五飛  △１七馬  
  30 ２八角打     ( 0:01/00:00:15)
*#形勢[-394]▲７七角打  △１九角成  ▲２二角成  △同金  ▲６九玉  △７二玉  ▲２五飛  △２四歩打  ▲同飛  △３三銀  ▲２五飛  
  31 ７七角打     ( 0:01/00:00:16)
*#形勢[-430]△１九角成  ▲２二角成  △同金  ▲６八玉  △８二香打  ▲２五飛  △２三歩打  
  32 １九角成(28) ( 0:01/00:00:16)
*#形勢[-547]▲２二角成  △同金  ▲２五飛  △２三歩打  ▲６八玉  △２八馬  ▲８五飛  △８二香打  ▲２五飛  △１七馬  ▲４一飛打  
  33 ２二角成(77) ( 0:01/00:00:17)
*#形勢[-393]△２二金  ▲６八玉  △７二銀  ▲２五飛  △２三歩打  ▲４一飛打  △５一金  
  34 ２二金(32)   ( 0:01/00:00:17)
*#形勢[-367]▲６八玉  △２八馬  ▲２五飛  △２四歩打  ▲同飛  △３三銀  ▲２五飛  
  35 ６八玉(59)   ( 0:01/00:00:18)
*#形勢[-476]△７二銀  ▲８六歩  △２八馬  ▲２五飛  △２三歩打  ▲４一飛打  
  36 ７二銀(71)   ( 0:01/00:00:18)
*#形勢[-364]▲８五飛  △８三香打  ▲２五飛  △２三歩打  ▲４一飛打  △５一金  
  37 ８五飛(35)   ( 0:01/00:00:19)
*#形勢[-496]△７一玉  ▲２五飛  △２四歩打  ▲同飛  △３三銀  ▲２五飛  △２四香打  
  38 ７一玉(62)   ( 0:01/00:00:19)
*#形勢[-250]▲８二飛打  △８三歩打  ▲同飛上成  △同銀  ▲４二飛成  △７二飛打  ▲４一龍  
  39 ８二飛打     ( 0:01/00:00:20)
*#形勢[-479]△８四歩打  ▲同飛引成  △８三歩打  ▲２四龍  △３三銀  ▲２六龍  
  40 ８四歩打     ( 0:01/00:00:20)
*#形勢[-346]▲８四飛引成  △８三歩打  ▲２四龍  △３三銀  ▲２六龍  △２三香打  ▲３五龍  
  41 ８四飛成(82) ( 0:01/00:00:21)
*#形勢[-294]△８三歩打  ▲３四龍  △３三金  ▲２五龍  △８四香打  ▲２一龍  
  42 ８三歩打     ( 0:01/00:00:21)
*#形勢[-358]▲３四龍  △２八馬  ▲２五飛  △３三銀  ▲４三龍  △１七馬  ▲４一龍  
  43 ３四龍(84)   ( 0:01/00:00:22)
*#形勢[-243]△２八馬  ▲２五桂  △１四歩  ▲２四龍  △２三香打  ▲３五龍  
  44 ２八馬(19)   ( 0:01/00:00:22)
*#形勢[-421]▲２五桂  △１七馬  ▲４六歩  △４四馬  ▲２四龍  △２三香打  
  45 ２五桂(17)   ( 0:01/00:00:23)
*#形勢[-381]△１七馬  ▲４五飛  △８二玉  ▲７九玉  △４四歩  ▲４六飛  
  46 １七馬(28)   ( 0:01/00:00:23)
*#形勢[-279]▲４五飛  △３三桂  ▲３五飛  △同馬  ▲同龍  
  47 ４五飛(85)   ( 0:01/00:00:24)
*#形勢[-455]△３三桂  ▲３五飛  △同馬  ▲同龍  △１七角打  ▲３四龍  △４四角成  
  48 ３三桂(21)   ( 0:01/00:00:24)
*#形勢[-405]▲４六飛  △３二金  ▲７九玉  △８二玉  ▲３六飛  △３五香打  
  49 ４六飛(45)   ( 0:01/00:00:25)
*#形勢[-295]△６四香打  ▲２六歩  △２五桂  ▲同龍  △３二金  ▲２一龍  
  50 ６四香打     ( 0:01/00:00:25)
*#形勢[-146]▲３六飛  △６七香成  ▲同金  △４四馬  ▲同龍  △同歩  ▲３三桂成  △同金  
  51 ３六飛(46)   ( 0:01/00:00:26)
*#形勢[-391]△４四馬  ▲２四龍  △２五桂  ▲同龍  △５五角打  ▲７七銀  △６五桂打  
  52 ４四馬(17)   ( 0:01/00:00:26)
*#形勢[-486]▲２四龍  △２五桂  ▲同龍  △４五角打  ▲５六桂打  △６七香  ▲同金  △３六角  ▲同歩  
  53 ２四龍(34)   ( 0:01/00:00:27)
*#形勢[-387]△２五桂  ▲同龍  △５五桂打  ▲５八金  △６七桂  ▲同金右  
  54 ２五桂(33)   ( 0:01/00:00:27)
*#形勢[-463]▲２五龍  △５五桂打  ▲７九桂打  △４五角打  ▲５六飛  △同角  ▲同歩  
  55 ２五龍(24)   ( 0:01/00:00:28)
*#形勢[-416]△４五角打  ▲３四桂打  △６七香  ▲同金  △３六角  ▲同龍  △８八馬  ▲４二桂成  
  56 ４五角打     ( 0:01/00:00:28)
*#形勢[-283]▲５六桂打  △３六角  ▲同歩  △６七香成  ▲同玉  △６九飛打  ▲６八金  △５五桂打  ▲７八玉  
  57 ５六桂打     ( 0:01/00:00:29)
*#形勢[-671]△３六角  ▲同歩  △６七香成  ▲同玉  △６九飛打  ▲６八香打  △５五桂打  ▲５八玉  △８九飛成  ▲７九金  
  58 ３六角(45)   ( 0:01/00:00:29)
*#形勢[-654]▲３六歩  △６七香成  ▲同玉  △６九飛打  ▲６八香打  △５五桂打  ▲５八玉  △８九飛成  ▲７九金  
  59 ３六歩(37)   ( 0:01/00:00:30)
*#形勢[-278]△６七香成  ▲同玉  △６九飛打  ▲６八香打  △５五桂打  ▲５八玉  △８九飛成  ▲７九金  △４七桂成  ▲同銀  
  60 ６七香成(64) ( 0:01/00:00:30)
*#形勢[-659]▲６七玉  △６九飛打  ▲６八香打  △５五桂打  ▲５八玉  △８九飛成  ▲７九金  △４七桂成  ▲同玉  △８八馬  
  61 ６七玉(68)   ( 0:01/00:00:31)
*#形勢[-252]△６九飛打  ▲６八香打  △５五桂打  ▲５八玉  △８九飛成  ▲７九金  △４七桂成  ▲同銀  △８八馬  
  62 ６九飛打     ( 0:01/00:00:31)
*#形勢[-556]▲６八歩打  △５五桂打  ▲５八玉  △８九飛成  ▲７九金  △６六桂打  ▲４八玉  
  63 ６八歩打     ( 0:01/00:00:32)
*#形勢[-506]△５五桂打  ▲７七玉  △８九飛成  ▲４四桂  △６五桂打  ▲６六玉  
  64 ５五桂打     ( 0:01/00:00:32)
*#形勢[-352]▲５八玉  △８九飛成  ▲７九金  △４七桂成  ▲同玉  △８八龍  ▲同金  △同馬  
  65 ５八玉(67)   ( 0:01/00:00:33)
*#形勢[-363]△８九飛成  ▲７九金  △４七桂成  ▲同玉  △８八龍  ▲同金  △同馬  
  66 ８九飛成(69) ( 0:01/00:00:33)
*#形勢[-227]▲７九金  △４七桂成  ▲同玉  △８八龍  ▲同金  △同馬  ▲４一飛打  
  67 ７九金(78)   ( 0:01/00:00:34)
*#形勢[-248]△４七桂成  ▲同玉  △８八龍  ▲同金  △同馬  ▲４一飛打  △３一金打  
  68 ４七桂成(55) ( 0:01/00:00:34)
*#形勢[-257]▲４七玉  △８八龍  ▲同金  △同馬  ▲３四桂打  △３三銀  
  69 ４七玉(58)   ( 0:01/00:00:35)
*#形勢[-247]△８八龍  ▲同金  △同馬  ▲４一飛打  △３一金打  
  70 ８八龍(89)   ( 0:01/00:00:35)
*#形勢[-276]▲８八金  △同馬  ▲３四桂打  △２四歩打  ▲４二桂成  
  71 ８八金(79)   ( 0:01/00:00:36)
*#形勢[-289]△８八馬  ▲３四桂打  △３二金  ▲４二桂成  △同金  
  72 ８八馬(44)   ( 0:01/00:00:36)
*#形勢[-296]▲３四桂打  △２四歩打  ▲７五龍  △５五桂打  ▲３七玉  
  73 ３四桂打     ( 0:01/00:00:37)
*#形勢[-385]△３二金  ▲４二桂成  △同金  ▲２二角打  △３三桂打  
  74 ３二金(22)   ( 0:01/00:00:37)
*#形勢[-241]▲４二桂成  △同金  ▲３一角打  △５二金寄  ▲２二角成  
  75 ４二桂成(34) ( 0:01/00:00:38)
*#形勢[-327]△４二金  ▲３一飛打  △９九馬  ▲２一龍  △５五馬  
  76 ４二金(32)   ( 0:01/00:00:38)
*#形勢[-260]▲３一飛打  △９九馬  ▲２一龍  △５五馬  ▲４六歩打  △２二銀打  
  77 ３一飛打     ( 0:01/00:00:39)
*#形勢[-367]△９九馬  ▲２一龍  △５五馬  ▲４六歩打  △２二銀打  
  78 ９九馬(88)   ( 0:01/00:00:39)
*#形勢[-376]▲２一龍  △２二銀打  ▲３五飛成  △２三桂打  ▲２五龍  
  79 ２一龍(25)   ( 0:01/00:00:40)
*#形勢[-416]△２二銀打  ▲３五飛成  △５四桂打  ▲３七玉  
  80 ２二銀打     ( 0:01/00:00:40)
*#形勢[-476]▲３五飛成  △２三桂打  ▲２五龍  △３三馬  ▲５一銀打  
  81 ３五飛成(31) ( 0:01/00:00:41)
*#形勢[-759]△２三桂打  ▲３四龍  △３三馬  ▲２五龍  △２四香打  
  82 ２三桂打     ( 0:01/00:00:41)
*#形勢[-800]▲３四龍  △３三馬  ▲同龍  △同銀  ▲２三龍  
  83 ３四龍(35)   ( 0:01/00:00:42)
*#形勢[-880]△３三馬  ▲同龍  △同銀  ▲１一龍  △８二玉  
  84 ３三馬(99)   ( 0:01/00:00:42)
*#形勢[-899]▲３三龍  △同銀  ▲１一龍  △７九飛打  ▲３一龍  
  85 ３三龍(34)   ( 0:01/00:00:43)
*#形勢[-1002]△３三銀  ▲４六歩打  △５五桂打  ▲３七玉  △１八飛打  
  86 ３三銀(22)   ( 0:01/00:00:43)
*#形勢[-1013]▲１一龍  △５五桂打  ▲３七玉  △１八飛打  ▲４六歩打  △２一歩打  ▲１三龍  
  87 １一龍(21)   ( 0:01/00:00:44)
*#形勢[-878]△７九飛打  ▲３一龍  △４一金打  ▲２一龍  △４五香打  ▲４六歩打  
  88 ７九飛打     ( 0:01/00:00:44)
*#形勢[-865]▲３一龍  △３二金打  ▲２一龍  
  89 ３一龍(11)   ( 0:01/00:00:45)
*#形勢[-808]△４五香打  ▲４六歩打  △同香  ▲同玉  △３四桂打  ▲３七玉  
  90 ４五香打     ( 0:01/00:00:45)
*#形勢[-629]▲４六歩打  △３四桂打  ▲４五歩  △４六金打  ▲４八玉  
  91 ４六歩打     ( 0:01/00:00:46)
*#形勢[-518]△４六香  ▲同玉  △３四桂打  ▲３七玉  △３五歩打  ▲２八玉  △３六歩  
  92 ４六香(45)   ( 0:01/00:00:46)
*#形勢[-411]▲４六玉  △３四桂打  ▲３七玉  △３五歩打  ▲２八玉  △３六歩  
  93 ４六玉(47)   ( 0:01/00:00:47)
*#形勢[-557]△４四歩  ▲３七玉  △４五桂打  ▲２八玉  △７六飛成  ▲パス  
  94 ４四歩(43)   ( 0:01/00:00:47)
*#形勢[-616]▲３七玉  △４五桂打  ▲２八玉  △３七歩打  ▲４六角打  
  95 ３七玉(46)   ( 0:01/00:00:48)
*#形勢[-571]△４五桂打  ▲２八玉  △３七歩打  ▲４六角打  
  96 ４五桂打     ( 0:01/00:00:48)
*#形勢[-419]▲２六玉  △３七歩打  ▲２五角打  
  97 ２六玉(37)   ( 0:01/00:00:49)
*#形勢[-692]△３七歩打  ▲２五角打  △３八歩成  ▲６一角成  
  98 ３七歩打     ( 0:01/00:00:49)
*#形勢[-952]▲６二香打  △３八歩成  ▲同金  
  99 ６二香打     ( 0:01/00:00:50)
*#形勢[-700]△３八歩成  ▲６一香成  △同銀  ▲３八金  
 100 ３八歩成(37) ( 0:01/00:00:50)
*#形勢[-697]▲６一香成  △同銀  ▲３八金  △２四香打  ▲１七玉  
 101 ６一香成(62) ( 0:01/00:00:51)
*#形勢[-1015]△６一銀  ▲３八金  △２四香打  ▲１七玉  △１九飛成  ▲１八金打  
 102 ６一銀(72)   ( 0:01/00:00:51)
*#形勢[-1084]▲３八金  △２四香打  ▲１七玉  △２九飛成  ▲２八金打  
 103 ３八金(49)   ( 0:01/00:00:52)
*#形勢[-1071]△２四香打  ▲１七玉  △２九飛成  ▲２八金打  
 104 ２四香打     ( 0:01/00:00:52)
*#形勢[-909]▲１七玉  △３七金打  ▲６二銀打  △同玉  ▲５一角打  △７二玉  
 105 １七玉(26)   ( 0:01/00:00:53)
*#形勢[-1221]△３七銀打  ▲３九香打  △３八銀  ▲７二金打  
 106 ３七銀打     ( 0:01/00:00:53)
*#形勢[-923]▲６二香打  △同玉  ▲５一角打  △７二玉  ▲４二角成  
 107 ６二香打     ( 0:01/00:00:54)
*#形勢[-1147]△６二玉  ▲５一銀打  △７二玉  ▲４二銀  
 108 ６二玉(71)   ( 0:01/00:00:54)
*#形勢[-1361]▲４三歩打  △３八銀  ▲５一角打  △７二玉  
 109 ４三歩打     ( 0:01/00:00:55)
*#形勢[-1742]△３八銀  ▲５一角打  △７二玉  ▲４二歩成  
 110 ３八銀(37)   ( 0:01/00:00:55)
*#形勢[-1875]▲２八銀打  △４三金  ▲５一角打  △７二玉  
 111 ２八銀打     ( 0:01/00:00:56)
*#形勢[-2542]△２七銀  ▲同銀  △同香成  ▲同玉  △２四香打  ▲２六銀打  
 112 ２七銀(38)   ( 0:01/00:00:56)
*#形勢[-2714]▲５一角打  △７二玉  ▲２七銀  △同香成  ▲同玉  
 113 ５一角打     ( 0:01/00:00:57)
*#形勢[-2947]△７二玉  ▲２七銀  △同香成  ▲同玉  △２四香打  ▲２六銀打  
 114 ７二玉(62)   ( 0:01/00:00:57)
*#形勢[-3543]▲２七銀  △同香成  ▲同玉  △２四香打  ▲２六香打  △２九飛成  ▲２八金打  
 115 ２七銀(28)   ( 0:01/00:00:58)
*#形勢[-3464]△２七香成  ▲同玉  △２四香打  ▲２六香打  △２九飛成  ▲２八金打  
 116 ２七香成(24) ( 0:01/00:00:58)
 117 ２七玉(17)   ( 0:01/00:00:59)
*#1手のみ
*#形勢[-4071]△２四香打  ▲２五金打  △２九飛成  ▲２八銀打  
 118 ２四香打     ( 0:01/00:00:59)
*#形勢[-4000]▲２六銀打  △２九飛成  ▲２八香打  △３七金打  ▲１七玉  
 119 ２六銀打     ( 0:01/00:01:00)
*#形勢[-29997]△３七金打  ▲１七玉  △２七金打  
 120 ３七金打     ( 0:01/00:01:00)
 121 投了         ( 0:01/00:01:01)
まで120手で後手の勝ち

            ",
            'created_at' => new DateTime(),
            'updated_at' => new DateTime(),
        ]);
        
        DB::table('records')->insert([
            'user_id' => 7,
            'title' => 'ぴよ将棋レベル25同士対局',
            'first_player_name' => 'Lv25 ひよ生(R1610)',
            'second_player_name' => 'Lv25 ひよ生(R1610)',
            'remark' => '5分+5秒ルールでの対局',
            'record' => "
            # ----  ぴよ将棋 棋譜ファイル  ----
棋戦：ぴよ将棋 (5分+5秒)
戦型：
開始日時：2024/03/28 21:09:24
終了日時：2024/03/28 21:14:37
手合割：平手
先手：Lv25 ひよ生(R1610)
後手：Lv25 ひよ生(R1610)
手数----指手---------消費時間--
   1 ７六歩(77)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７六歩   ▲６八銀   
   2 ３四歩(33)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: △３四歩   △８四歩   △４二銀   △３二金   
   3 ２六歩(27)   ( 0:01/00:00:02)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７五歩   ▲６六歩   
   4 ３二金(41)   ( 0:01/00:00:02)
*#定跡手
*#定跡: △８四歩   △４四歩   △５四歩   △３二金   
   5 ７八金(69)   ( 0:01/00:00:03)
*#定跡手
*#定跡: ▲７八金   ▲２五歩   
   6 ８八角成(22) ( 0:01/00:00:03)
*#定跡手
*#定跡: △４四歩   △８四歩   △８八角成   △９四歩   
   7 ８八銀(79)   ( 0:01/00:00:04)
*#定跡手
*#定跡: ▲８八銀   
   8 ４二銀(31)   ( 0:01/00:00:04)
*#定跡手
*#定跡: △４二銀   
   9 ３八銀(39)   ( 0:01/00:00:05)
*#定跡手
*#定跡: ▲３八銀   ▲４八銀   ▲１六歩   
  10 ６二銀(71)   ( 0:01/00:00:05)
*#定跡手
*#定跡: △６二銀   
  11 ４六歩(47)   ( 0:01/00:00:06)
*#定跡手
*#定跡: ▲１六歩   ▲６八玉   ▲４六歩   ▲７七銀   ▲９六歩   
  12 ６四歩(63)   ( 0:01/00:00:06)
*#定跡手
*#定跡: △６四歩   
  13 ４七銀(38)   ( 0:01/00:00:07)
*#定跡手
*#定跡: ▲４七銀   ▲３六歩   
  14 ６三銀(62)   ( 0:01/00:00:07)
*#定跡手
*#定跡: △６三銀   
  15 ６八玉(59)   ( 0:01/00:00:08)
*#定跡手
*#定跡: ▲６八玉   
  16 ４一玉(51)   ( 0:01/00:00:08)
*#定跡手
*#定跡: △１四歩   △８四歩   △９四歩   △４一玉   △７二金   △７四歩   △５四銀   
*#形勢[112]▲２五歩  △３一玉  ▲２四歩  △同歩  ▲同飛  △２三歩打  ▲２七飛  △５四銀  ▲２四歩打  △同歩  ▲同飛  △３三銀  ▲２八飛  
  17 ２五歩(26)   ( 0:01/00:00:09)
*#定跡: ▲７七銀   
*#形勢[124]△３三銀  ▲５八金  △５四銀  ▲７九玉  △７四歩  ▲５六銀  △３一玉  ▲６八金右  
  18 ３三銀(42)   ( 0:01/00:00:09)
*#形勢[92]▲５六銀  △３一玉  ▲３六歩  △５四銀  ▲６六歩  △８四歩  ▲３七桂  △７四歩  ▲３八金  
  19 ５六銀(47)   ( 0:01/00:00:10)
*#形勢[57]△３一玉  ▲３六歩  △５四銀  ▲６六歩  △８四歩  ▲５八金  △８五歩  ▲７七銀  △５二金  
  20 ３一玉(41)   ( 0:01/00:00:10)
*#形勢[74]▲６六歩  △５四銀  ▲３六歩  △７四歩  ▲７九玉  △８四歩  ▲７七銀  △８五歩  ▲９六歩  
  21 ６六歩(67)   ( 0:01/00:00:11)
*#形勢[59]△５四銀  ▲７七銀  △５二金  ▲３六歩  △８四歩  ▲７九玉  △４二金右  ▲５八金  △２二玉  
  22 ５四銀(63)   ( 0:01/00:00:11)
*#形勢[44]▲７七銀  △５二金  ▲７九玉  △８四歩  ▲５八金  △４四歩  ▲３六歩  △１四歩  ▲２七飛  
  23 ７七銀(88)   ( 0:01/00:00:12)
*#形勢[43]△８四歩  ▲７九玉  △５二金  ▲５八金  △４四歩  ▲６八金右  △８五歩  ▲３六歩  △２二玉  
  24 ８四歩(83)   ( 0:01/00:00:12)
*#形勢[49]▲７九玉  △５二金  ▲５八金  △４四歩  ▲３六歩  △７四歩  ▲６七金右  △７三桂  ▲１六歩  
  25 ７九玉(68)   ( 0:01/00:00:13)
*#形勢[65]△５二金  ▲５八金  △４四歩  ▲３六歩  △２二玉  ▲３七桂  △４二金右  ▲９六歩  △１四歩  
  26 ５二金(61)   ( 0:01/00:00:13)
*#形勢[39]▲５八金  △７四歩  ▲３六歩  △８五歩  ▲８八玉  △４四歩  ▲１六歩  △２二玉  
  27 ５八金(49)   ( 0:01/00:00:14)
*#形勢[40]△４四歩  ▲３六歩  △７四歩  ▲３七桂  △８五歩  ▲８八玉  △７三桂  ▲４五歩  △同歩  ▲同銀  △３九角打  
  28 ４四歩(43)   ( 0:01/00:00:14)
*#形勢[45]▲３六歩  △７四歩  ▲３七桂  △２二玉  ▲９六歩  △４二金右  ▲４五歩  △同歩  ▲同銀  △４三金直  ▲５四銀  △同歩  
  29 ３六歩(37)   ( 0:01/00:00:15)
*#形勢[37]△７四歩  ▲３七桂  △２二玉  ▲８八玉  △７三桂  ▲４五歩  △同歩  ▲同銀  △４三金右  ▲５四銀  △同歩  ▲７一角打  △４二飛  ▲２六角成  
  30 ７四歩(73)   ( 0:01/00:00:15)
*#形勢[-4]▲３七桂  △７三桂  ▲１六歩  △２二玉  ▲４五歩  △６二飛  
  31 ３七桂(29)   ( 0:01/00:00:16)
*#形勢[59]△７三桂  ▲４八飛  △２二玉  ▲４五歩  △同歩  ▲同銀  △５五角打  ▲５四銀  △３七角成  ▲４一飛成  △５四歩  ▲９一龍  △６二飛  
  32 ７三桂(81)   ( 0:01/00:00:16)
*#形勢[32]▲８八玉  △２二玉  ▲４五歩  △同歩  ▲同桂  △４四銀  ▲２四歩  △同歩  ▲同飛  △２三歩打  ▲３四飛  △４五銀直  ▲同銀  △同銀  ▲６四飛  △６九銀打  ▲６八金左  
  33 ８八玉(79)   ( 0:01/00:00:17)
*#形勢[-24]△２二玉  ▲４七金  △４二金右  ▲９六歩  △６五歩  ▲同歩  △同銀  ▲９五歩  △５六銀  ▲同金  
  34 ２二玉(31)   ( 0:01/00:00:17)
*#形勢[66]▲９六歩  △６三金  ▲４五歩  △４二飛  ▲４四歩  △同飛  ▲４五歩打  △４二飛  
  35 ９六歩(97)   ( 0:01/00:00:18)
*#形勢[54]△６三金  ▲４五歩  △４二飛  ▲８一角打  △６二金  ▲２四歩  △同歩  ▲４四歩  △同飛  
  36 ６三金(52)   ( 0:01/00:00:18)
*#形勢[-6]▲４五歩  △同歩  ▲同銀  △４二飛  ▲４八飛  △６五歩  ▲４四歩打  △６四角打  ▲５四銀  △同金  
  37 ４五歩(46)   ( 0:01/00:00:19)
*#形勢[68]△４五歩  ▲同桂  △４四銀  ▲２四歩  △同歩  ▲５一角打  △４五銀右  ▲同銀  △同銀  ▲２四角成  △２三歩打  ▲同馬  
  38 ４五歩(44)   ( 0:01/00:00:19)
*#形勢[-11]▲４五銀  △４二飛  ▲４八飛  △５五角打  ▲５四銀  △同金  ▲４二飛成  △同銀  ▲４三歩打  △同銀  
  39 ４五銀(56)   ( 0:01/00:00:20)
*#形勢[137]△４二飛  ▲５一角打  △４三飛  ▲５四銀  △同金  ▲７三角成  △４九飛成  ▲９一馬  △１九龍  
  40 ４二飛(82)   ( 0:01/00:00:20)
*#形勢[163]▲５一角打  △４一飛  ▲３三角成  △同金  ▲５二銀打  △４二飛  ▲６三銀  △同銀  ▲２四歩  
  41 ５一角打     ( 0:01/00:00:21)
*#形勢[302]△４一飛  ▲３三角成  △同金  ▲５二銀打  △４二飛  ▲６三銀  △同銀  ▲３五歩  △６九銀打  ▲３四歩  △３二金  
  42 ４一飛(42)   ( 0:01/00:00:21)
*#形勢[101]▲３三角成  △同金  ▲５二銀打  △４二飛  ▲６三銀  △同銀  ▲３五歩  △同歩  ▲４四歩打  △６九銀打  
  43 ３三角成(51) ( 0:01/00:00:22)
*#形勢[314]△３三桂  ▲５二銀打  △４二飛  ▲６三銀成  △４五桂  ▲５三成銀  △３七桂成  ▲４二成銀  △同金  ▲２九飛  △３八角打  
  44 ３三桂(21)   ( 0:01/00:00:22)
*#形勢[383]▲５二銀打  △４二飛  ▲６三銀成  △４五桂  ▲５三成銀  △３七桂成  ▲４二成銀  △同金  ▲２九飛  △３八成桂  ▲２六飛  
  45 ５二銀打     ( 0:01/00:00:23)
*#形勢[317]△４二飛  ▲６三銀成  △４五桂  ▲５三成銀  △３七桂成  ▲４二成銀  △同金  ▲２九飛  △３八成桂  ▲２六飛  
  46 ４二飛(41)   ( 0:01/00:00:23)
*#形勢[412]▲６三銀成  △４五桂  ▲５三成銀  △３七桂成  ▲４二成銀  △同金  ▲２九飛  △３八成桂  ▲２六飛  
  47 ６三銀成(52) ( 0:01/00:00:24)
*#形勢[346]△４五桂  ▲５三成銀  △３七桂成  ▲４二成銀  △同金  ▲２九飛  △３八成桂  ▲５一飛打  △２九成桂  ▲５四飛成  △１九成桂  
  48 ４五桂(33)   ( 0:01/00:00:24)
*#形勢[427]▲５三成銀  △３七桂成  ▲４二成銀  △同金  ▲２九飛  △３八銀打  ▲７九飛  △４七成桂  ▲６八金右  △８五桂  
  49 ５三成銀(63) ( 0:01/00:00:25)
*#形勢[451]△３七桂成  ▲４二成銀  △同金  ▲７二飛打  △５二歩打  ▲２四歩  △２八成桂  ▲７三飛成  △２四歩  
  50 ３七桂成(45) ( 0:01/00:00:25)
*#形勢[519]▲４二成銀  △同金  ▲２九飛  △３八角打  ▲７九飛  △３三銀打  ▲５一飛打  △４七成桂  ▲２一金打  △３二玉  
  51 ４二成銀(53) ( 0:01/00:00:26)
*#形勢[668]△４二金  ▲７二飛打  △３三銀打  ▲２九飛  △８五桂  ▲８六銀  △３八角打  ▲３九飛  
  52 ４二金(32)   ( 0:01/00:00:26)
*#形勢[468]▲２九飛  △３八角打  ▲５九飛  △３三銀打  ▲５一飛打  △４一歩打  
  53 ２九飛(28)   ( 0:01/00:00:27)
*#形勢[513]△３八角打  ▲７二飛打  △３三銀打  ▲３九飛  △８五桂  ▲３八飛  △同成桂  
  54 ３八角打     ( 0:01/00:00:27)
*#形勢[672]▲３九飛  △２七角成  ▲７二飛打  △５三銀打  ▲７三飛成  △３六馬  ▲６八金右  △パス  
  55 ３九飛(29)   ( 0:01/00:00:28)
*#形勢[506]△２七角成  ▲７二飛打  △３三銀打  ▲７三飛成  △３六馬  ▲６八金右  △４一歩打  ▲４四歩打  △４八角打  
  56 ２七角成(38) ( 0:01/00:00:28)
*#形勢[531]▲７二飛打  △３三銀打  ▲７三飛成  △３六馬  ▲６八金右  △４一歩打  ▲６二龍  △５二歩打  ▲６四龍  △８五桂打  ▲８六歩  
  57 ７二飛打     ( 0:01/00:00:29)
*#形勢[534]△３三銀打  ▲７三飛成  △３六馬  ▲６八金右  △８五桂打  ▲８六銀  △４八角打  ▲４九飛  
  58 ３三銀打     ( 0:01/00:00:29)
*#形勢[874]▲５三金打  △５二歩打  ▲４二金  △同銀  ▲５二飛成  △５三銀打  ▲３五歩  △８五桂  ▲８六銀  △４三金打  
  59 ５三金打     ( 0:01/00:00:30)
*#形勢[890]△５二歩打  ▲４二金  △同銀  ▲７三飛成  △３六馬  ▲６八金右  △３三銀打  ▲７一龍  △４三銀引  ▲９一龍  
  60 ５二歩打     ( 0:01/00:00:30)
*#形勢[894]▲４二金  △同銀  ▲７三飛成  △３六馬  ▲６八金右  △８五桂打  ▲２四歩  △７七桂成  ▲同金右  
  61 ４二金(53)   ( 0:01/00:00:31)
*#形勢[1109]△４二銀  ▲５二飛成  △３二金打  ▲５四龍  △８五桂  ▲３四龍  △７七桂  ▲４一銀打  △３三銀打  
  62 ４二銀(33)   ( 0:01/00:00:31)
*#形勢[1240]▲５二飛成  △３二金打  ▲５四龍  △３六馬  ▲３四龍  △５八馬  ▲２四歩  △３三金打  ▲３七龍  
  63 ５二飛成(72) ( 0:01/00:00:32)
*#形勢[984]△５三銀打  ▲４一龍  △３三玉  ▲１一龍  △３六馬  ▲４九香打  △４六歩打  ▲同香  △同馬  
  64 ５三銀打     ( 0:01/00:00:32)
*#形勢[691]▲３五歩  △３三玉  ▲２九飛  △３六馬  ▲２四歩  △５八馬  ▲２三歩成  △４四玉  
  65 ３五歩(36)   ( 0:01/00:00:33)
*#形勢[657]△３三玉  ▲２九飛  △４五馬  ▲４九飛  △３五馬  ▲４二飛成  △同銀  ▲５四龍  △６九角打  ▲６三龍  △５三金打  
  66 ３三玉(22)   ( 0:01/00:00:33)
*#形勢[666]▲２九飛  △４五馬  ▲４九飛  △３五馬  ▲４二飛成  △同銀  ▲５四龍  △６九角打  ▲６三龍  △５三金打  ▲７三龍  
  67 ２九飛(39)   ( 0:01/00:00:34)
*#形勢[610]△３八馬  ▲２六飛  △３五歩  ▲６八金右  △３四角打  ▲４三歩打  △同銀引  
  68 ３八馬(27)   ( 0:01/00:00:34)
*#形勢[512]▲２六飛  △３五歩  ▲６八金右  △８五桂  ▲８六銀  △３四玉  
  69 ２六飛(29)   ( 0:01/00:00:35)
*#形勢[486]△３五歩  ▲４五歩打  △８五桂打  ▲３四歩打  △同玉  ▲４二龍  △４三金打  ▲３二龍  △４五玉  
  70 ３五歩(34)   ( 0:01/00:00:35)
*#形勢[332]▲６七金右  △５八角打  ▲６八金引  △４七角成  ▲４三歩打  △同銀引  
  71 ６七金(58)   ( 0:01/00:00:36)
*#形勢[225]△３四桂打  ▲１六飛  △６九角打  ▲２四歩  △同歩  ▲４三歩打  △同銀引  
  72 ３四桂打     ( 0:01/00:00:36)
*#形勢[556]▲３九歩打  △同馬  ▲５六飛  △５五歩打  ▲４三歩打  △５六歩  ▲４二歩成  
  73 ３九歩打     ( 0:01/00:00:37)
*#形勢[455]△３九馬  ▲５六飛  △５五歩打  ▲１六飛  △６九角打  ▲６八金寄  △２五角成  
  74 ３九馬(38)   ( 0:01/00:00:37)
*#形勢[286]▲５六飛  △５五歩打  ▲１六飛  △４四玉  ▲２四歩  △８五桂  ▲２三歩成  △７七桂成  ▲同桂  
  75 ５六飛(26)   ( 0:01/00:00:38)
*#形勢[-50]△５五歩打  ▲１六飛  △４九角打  ▲４一金打  △８五桂  ▲４二金  △４四玉  ▲５三龍  △同玉  
  76 ５五歩打     ( 0:01/00:00:38)
*#形勢[38]▲１六飛  △４九馬  ▲３八歩打  △同馬  ▲２四歩  △４四玉  ▲２三歩成  
  77 １六飛(56)   ( 0:01/00:00:39)
*#形勢[141]△４九馬  ▲６八金引  △８五桂  ▲８六銀  △５九角打  
  78 ４九馬(39)   ( 0:01/00:00:39)
*#形勢[89]▲４一金打  △４四玉  ▲４二金  △８五桂  ▲４三銀打  
  79 ４一金打     ( 0:01/00:00:40)
*#形勢[617]△８五桂  ▲４二金  △同銀  ▲５四龍  △４三金打  ▲５五龍  △７七桂  ▲同金寄  
  80 ８五桂(73)   ( 0:01/00:00:40)
*#形勢[634]▲４二金  △同銀  ▲５四龍  △４三金打  ▲６四龍  △４四歩打  ▲５五龍  △７七桂  ▲同桂  △６九銀打  
  81 ４二金(41)   ( 0:01/00:00:41)
*#形勢[725]△４二銀  ▲５四龍  △４三金打  ▲５五龍  △５八角打  ▲４四歩打  △同金  
  82 ４二銀(53)   ( 0:01/00:00:41)
*#形勢[589]▲５四龍  △４三金打  ▲４五龍  △２七角打  ▲３五龍  △７七桂  ▲同金寄  △１六角成  
  83 ５四龍(52)   ( 0:01/00:00:42)
*#形勢[772]△４三金打  ▲５五龍  △５八角打  ▲３五龍  △２二玉  ▲６八金引  △７七桂成  ▲同桂  
  84 ４三金打     ( 0:01/00:00:42)
*#形勢[638]▲５五龍  △６九角打  ▲３五龍  △６七馬  ▲同金  △７八金打  ▲９八玉  △７七桂成  ▲同金  △８八金打  ▲９七玉  
  85 ５五龍(54)   ( 0:01/00:00:43)
*#形勢[869]△５八角打  ▲３五龍  △６七角成  ▲同金  △同馬  ▲１五角打  △２二玉  
  86 ５八角打     ( 0:01/00:00:43)
*#形勢[651]▲５二銀打  △４四金  ▲６四龍  △２五角成  ▲４五歩打  △同金  
  87 ５二銀打     ( 0:01/00:00:44)
*#形勢[618]△４四金  ▲同龍  △同玉  ▲４五歩打  △３三玉  ▲４四金打  △２二玉  ▲４三銀  △同銀  ▲３三銀打  △１二玉  
  88 ４四金(43)   ( 0:01/00:00:44)
*#形勢[1460]▲２二銀打  △同玉  ▲４四龍  △３三銀  ▲４三龍  △３二金打  ▲同龍  △同玉  ▲４三金打  △２二玉  
  89 ２二銀打     ( 0:01/00:00:45)
*#形勢[895]△２二玉  ▲４四龍  △３三銀打  ▲４三銀成  △４四銀  ▲３二金打  △１二玉  ▲４四成銀  △７七桂成  ▲同金寄  
  90 ２二玉(33)   ( 0:01/00:00:45)
*#形勢[1238]▲４四龍  △３三銀打  ▲４三銀成  △７七桂成  ▲同金寄  △４三銀  ▲同龍  △４二金打  ▲４五龍  △１六馬  ▲同歩  
  91 ４四龍(55)   ( 0:01/00:00:46)
*#形勢[1613]△３三銀打  ▲４三銀成  △７七桂成  ▲同金寄  △４四銀  ▲３二金打  △１二玉  ▲４四成銀  △２二金打  ▲３四成銀  
  92 ３三銀打     ( 0:01/00:00:46)
*#形勢[1197]▲４三銀成  △３一金打  ▲４九龍  △同角成  ▲３三成銀  △同銀  ▲４三金打  △４八飛打  ▲３三金  △同玉  ▲５五角打  △４四銀打  
  93 ４三銀成(52) ( 0:01/00:00:47)
*#形勢[1126]△３一金打  ▲４九龍  △同角成  ▲３三成銀  △同銀  ▲５三角打  △３二金  ▲６四角成  △７七桂成  ▲同金寄  
  94 ３一金打     ( 0:01/00:00:47)
*#形勢[937]▲４九龍  △同角成  ▲５四角打  △７七桂成  ▲同金寄  △４八飛打  ▲３二金打  △同金  
  95 ４九龍(44)   ( 0:01/00:00:48)
*#形勢[558]△４九角成  ▲３二歩打  △同金  ▲同成銀  △同玉  ▲５二金打  △４八飛打  ▲４一角打  △４三玉  ▲５六飛  △４四玉  
  96 ４九角成(58) ( 0:01/00:00:48)
*#形勢[634]▲４四歩打  △４八飛打  ▲６八銀  △４三銀  ▲同歩成  △同飛成  
  97 ４四歩打     ( 0:01/00:00:49)
*#形勢[440]△４八飛打  ▲６八銀  △４三銀  ▲同歩成  △同飛成  ▲５五角打  △１六馬  ▲同歩  △４八龍  
  98 ４八飛打     ( 0:01/00:00:49)
*#形勢[484]▲６八金引  △７七桂  ▲同金右  △４三銀  ▲同歩成  △同飛成  ▲５五角打  △４八龍  
  99 ６八金(67)   ( 0:01/00:00:50)
*#形勢[295]△７七桂成  ▲同金右  △６八銀打  ▲２四歩  △７七銀成  ▲同桂  △６七金打  ▲７九銀打  △２四銀  ▲１三飛成  
 100 ７七桂成(85) ( 0:01/00:00:50)
*#形勢[478]▲７七金右  △４三銀  ▲同歩成  △同飛成  ▲２四歩  △同銀  ▲５五角打  △４四歩打  ▲３七角  
 101 ７七金(68)   ( 0:01/00:00:51)
*#形勢[340]△４三銀  ▲同歩成  △同飛成  ▲５六飛  △４一龍  ▲５一角打  △３二金  ▲３三角成  △同金  
 102 ４三銀(42)   ( 0:01/00:00:51)
*#形勢[537]▲４三歩成  △同飛成  ▲５六飛  △６九銀打  ▲５一飛成  △７八銀成  ▲同金  △６九銀打  ▲６二龍  △４二龍  
 103 ４三歩成(44) ( 0:01/00:00:52)
*#形勢[595]△４三飛成  ▲２四歩  △同銀  ▲５五角打  △４四銀打  ▲６四角  △３二金  ▲９一角成  △３六成桂  ▲６四馬  
 104 ４三飛成(48) ( 0:01/00:00:52)
*#形勢[460]▲５六飛  △６九銀打  ▲７九金  △４八龍  ▲９七玉  △７八銀打  ▲５二飛成  △４二金  
 105 ５六飛(16)   ( 0:01/00:00:53)
*#形勢[470]△４二銀打  ▲６一角打  △４八龍  ▲５二飛成  △６九銀打  ▲４三銀打  △７八銀  ▲同金  
 106 ４二銀打     ( 0:01/00:00:53)
*#形勢[484]▲２四歩  △同銀  ▲５五角打  △３三銀引  ▲３七角  △７五歩  ▲２五桂打  △７六歩  ▲３三桂成  △同銀  
 107 ２四歩(25)   ( 0:01/00:00:54)
*#形勢[539]△２四銀  ▲５五角打  △３三銀引  ▲２五桂打  △７五歩  ▲３三桂成  △同銀  ▲６四角  △７六歩  ▲３一角成  △同玉  
 108 ２四銀(33)   ( 0:01/00:00:54)
*#形勢[611]▲５二角打  △４四龍  ▲３四角成  △同龍  ▲２六桂打  △４三龍  ▲３四桂打  △３三玉  
 109 ５二角打     ( 0:01/00:00:55)
*#形勢[355]△４五龍  ▲２五歩打  △３三銀引  ▲１五桂打  △５五歩打  ▲２四歩  △同銀  
 110 ４五龍(43)   ( 0:01/00:00:55)
*#形勢[595]▲６三角成  △５六龍  ▲同歩  △４八飛打  ▲６八銀打  △６五歩  ▲７一飛打  △５一歩打  ▲９一飛成  
 111 ６三角成(52) ( 0:01/00:00:56)
*#形勢[222]△４八龍  ▲９七玉  △９四歩  ▲５二飛成  △５一歩打  ▲７二龍  
 112 ４八龍(45)   ( 0:01/00:00:56)
*#形勢[56]▲９七玉  △５一歩打  ▲５四馬  △９四歩  ▲４三歩打  △同銀  ▲６四馬  
 113 ９七玉(88)   ( 0:01/00:00:57)
*#形勢[-23]△６八銀打  ▲同金  △同龍  ▲７四馬  △７九龍  ▲５二飛成  △８九龍  
 114 ６八銀打     ( 0:01/00:00:57)
*#形勢[385]▲６八金  △同龍  ▲５二飛成  △５一歩打  ▲７二龍  △７八金打  ▲４三歩打  △７七金  ▲４二歩成  
 115 ６八金(78)   ( 0:01/00:00:58)
*#形勢[461]△６八龍  ▲５二飛成  △５一歩打  ▲６二龍  △７九龍  ▲４三歩打  △５二金打  ▲同馬  △同歩  
 116 ６八龍(48)   ( 0:01/00:00:58)
*#形勢[96]▲５二飛成  △５一歩打  ▲６二龍  △７八金打  ▲４三歩打  △７七金  ▲４二歩成  
 117 ５二飛成(56) ( 0:01/00:00:59)
*#形勢[380]△７八金打  ▲同金  △同龍  ▲８八金打  △７六龍  ▲４三銀打  
 118 ７八金打     ( 0:01/00:00:59)
*#形勢[690]▲７八金  △同龍  ▲８八金打  △４八龍  ▲４三歩打  △５一歩打  ▲４二龍  △同金  ▲同歩成  △同龍  
 119 ７八金(77)   ( 0:01/00:01:00)
*#形勢[439]△７八龍  ▲８八金打  △４八龍  ▲４三歩打  △７六馬  ▲４二歩成  △同金  ▲５一龍  
 120 ７八龍(68)   ( 0:01/00:01:00)
*#形勢[594]▲８八金打  △４八龍  ▲４三歩打  △７六馬  ▲４二歩成  △同金  ▲６一龍  △７五馬  ▲８六銀打  
 121 ８八金打     ( 0:01/00:01:01)
*#形勢[466]△４八龍  ▲５四馬  △５一歩打  ▲７二龍  △５二歩  ▲５五馬  △４四歩打  
 122 ４八龍(78)   ( 0:01/00:01:01)
*#形勢[565]▲５四馬  △５一歩打  ▲７二龍  △５七龍  ▲４三銀打  △５四龍  ▲同銀成  
 123 ５四馬(63)   ( 0:01/00:01:02)
*#形勢[667]△５一歩打  ▲７二龍  △５七龍  ▲４三銀打  △５四龍  ▲同銀  △７六馬  ▲４二龍  
 124 ５一歩打     ( 0:01/00:01:02)
*#形勢[684]▲７二龍  △５七龍  ▲４三銀打  △５四龍  ▲同銀成  △７九角打  ▲５三金打  △７六馬  
 125 ７二龍(52)   ( 0:01/00:01:03)
*#形勢[900]△４四金打  ▲６四馬  △５二歩  ▲７七金  △７六馬  
 126 ４四金打     ( 0:01/00:01:03)
*#形勢[956]▲６四馬  △４一歩打  ▲７七銀打  △９四歩  ▲９一馬  △９五歩  ▲４五歩打  △９六歩  ▲同玉  
 127 ６四馬(54)   ( 0:01/00:01:04)
*#形勢[907]△４三金  ▲７四龍  △７三歩打  ▲同龍  △４四歩打  ▲８四龍  
 128 ４三金(44)   ( 0:01/00:01:04)
*#形勢[1249]▲７七銀打  △６七馬  ▲５五馬  △３二玉  ▲５四桂打  △５七龍  
 129 ７七銀打     ( 0:01/00:01:05)
*#形勢[854]△２七馬  ▲５五馬  △４四歩打  ▲７四龍  △４五馬  ▲同馬  △同龍  
 130 ２七馬(49)   ( 0:01/00:01:05)
*#形勢[996]▲５五馬  △４四歩打  ▲７四龍  △５七龍  ▲９一馬  △４五馬  ▲８四龍  
 131 ５五馬(64)   ( 0:01/00:01:06)
*#形勢[-96]△４四金  ▲同馬  △同龍  ▲７三龍  △５四馬  ▲９八玉  △６七角打  ▲４三歩打  
 132 ４四金(43)   ( 0:01/00:01:06)
*#形勢[155]▲４四馬  △同龍  ▲６一龍  △５四馬  ▲９八玉  △７五歩  ▲９一龍  △７六歩  ▲６八銀  △４九龍  ▲４三歩打  
 133 ４四馬(55)   ( 0:01/00:01:07)
*#形勢[60]△４四龍  ▲６一龍  △３六馬  ▲５六桂打  △４八龍  ▲４三歩打  △同銀  ▲９一龍  
 134 ４四龍(48)   ( 0:01/00:01:07)
*#形勢[-145]▲６一龍  △４八龍  ▲４三歩打  △同銀  ▲９一龍  
 135 ６一龍(72)   ( 0:01/00:01:08)
*#形勢[175]△５四馬  ▲９八玉  △４八龍  ▲９一龍  △７五歩  ▲９三龍  △６七角打  
 136 ５四馬(27)   ( 0:01/00:01:08)
*#形勢[152]▲９八玉  △４八龍  ▲９一龍  △７五歩  ▲７八金打  △７六歩  ▲６八銀  
 137 ９八玉(97)   ( 0:01/00:01:09)
*#形勢[-16]△４八龍  ▲２五歩打  △同銀  ▲９一龍  △７九角打  ▲９三龍  △８八角成  ▲同銀  
 138 ４八龍(44)   ( 0:01/00:01:09)
*#形勢[17]▲４九歩打  △２八龍  ▲９一龍  △７五歩  ▲９三龍  △７六歩  ▲３二銀打  
 139 ４九歩打     ( 0:01/00:01:10)
*#形勢[-21]△４九龍  ▲９一龍  △６七角打  ▲４三歩打  △同馬  ▲９三龍  △１九龍  ▲４三龍  △同銀  
 140 ４九龍(48)   ( 0:01/00:01:10)
*#形勢[-40]▲９一龍  △７五歩  ▲４三歩打  △同馬  ▲９三龍  △７六歩  
 141 ９一龍(61)   ( 0:01/00:01:11)
*#形勢[-78]△７五歩  ▲７一龍  △７六歩  ▲同銀  △１九龍  ▲４三歩打  △同馬  ▲３二銀打  
 142 ７五歩(74)   ( 0:01/00:01:11)
*#形勢[-157]▲７一龍  △７六歩  ▲同銀  △１九龍  ▲７八金打  △７七歩打  ▲同桂  △７五歩打  
 143 ７一龍(91)   ( 0:01/00:01:12)
*#形勢[-249]△７六歩  ▲同銀  △７七歩打  ▲同金  △１九龍  ▲４三歩打  △同馬  ▲７八金打  △７五歩打  ▲同龍  
 144 ７六歩(75)   ( 0:01/00:01:12)
*#形勢[-222]▲７六銀  △７七歩打  ▲６五銀  △４四馬  ▲７七龍  △１九龍  
 145 ７六銀(77)   ( 0:01/00:01:13)
*#形勢[-245]△５八角打  ▲６五銀  △４四馬  ▲７二龍  △３六角成  ▲７六龍  △１九龍  
 146 ５八角打     ( 0:01/00:01:13)
*#形勢[-328]▲６五銀  △４四馬  ▲７七龍  △１九龍  ▲１六桂打  △３三銀引  ▲５四金打  
 147 ６五銀(76)   ( 0:01/00:01:14)
*#形勢[-121]△３二馬  ▲７九歩打  △１九龍  ▲５四桂打  △６九角成  
 148 ３二馬(54)   ( 0:01/00:01:14)
*#形勢[62]▲５四桂打  △６九角成  ▲２五歩打  △３三銀引  ▲４二桂成  △同馬  ▲７七銀打  △８五桂打  ▲４三金打  
 149 ５四桂打     ( 0:01/00:01:15)
*#形勢[228]△８五角成  ▲４二桂成  △同馬  ▲７二龍  △５二歩  ▲４三歩打  △同馬  
 150 ８五角成(58) ( 0:01/00:01:15)
*#形勢[252]▲４二桂成  △同馬  ▲７二龍  △５二歩  ▲４三歩打  △同馬  ▲５四銀打  △２一馬  ▲４三銀成  
 151 ４二桂成(54) ( 0:01/00:01:16)
*#形勢[250]△４二馬  ▲７二龍  △５二歩  ▲７八金打  △１九龍  ▲７九歩打  △４九龍  ▲４三歩打  
 152 ４二馬(32)   ( 0:01/00:01:16)
*#形勢[272]▲７二龍  △５二歩  ▲４四歩打  △同龍  ▲７八金打  △４九龍  
 153 ７二龍(71)   ( 0:01/00:01:17)
*#形勢[301]△７一歩打  ▲同龍  △９六馬  ▲４三歩打  △同馬  ▲７二龍  △４二歩打  
 154 ７一歩打     ( 0:01/00:01:17)
*#形勢[474]▲４二龍  △同金  ▲５五角打  △４四歩打  ▲３七角  △９六馬  ▲７三角成  △６八飛打  
 155 ４二龍(72)   ( 0:01/00:01:18)
*#形勢[522]△４二金  ▲５五角打  △４四歩打  ▲６四角  △４一馬  ▲５四銀  △７六桂打  ▲４二角成  
 156 ４二金(31)   ( 0:01/00:01:18)
*#形勢[479]▲５五角打  △４四歩打  ▲６四角  △７二飛打  ▲４三歩打  △同金  ▲３一銀打  △３三玉  
 157 ５五角打     ( 0:01/00:01:19)
*#形勢[370]△４四歩打  ▲６四角  △３三玉  ▲３一銀打  △３二金  ▲４二銀打  △同金  ▲同角成  
 158 ４四歩打     ( 0:01/00:01:19)
*#形勢[226]▲６四角  △４一馬  ▲７八金打  △１九龍  ▲４三歩打  △同金  
 159 ６四角(55)   ( 0:01/00:01:20)
*#形勢[283]△４一馬  ▲２五歩打  △同銀  ▲２四歩打  △２七成桂  ▲４二角成  △同馬  ▲７八金打  △８九龍  
 160 ４一馬(85)   ( 0:01/00:01:20)
*#形勢[159]▲２五歩打  △同銀  ▲７八金打  △１九龍  ▲３七角  △６九龍  ▲６四角  
 161 ２五歩打     ( 0:01/00:01:21)
*#形勢[-3]△２五銀  ▲７七銀打  △３八飛打  ▲パス  △パス  
 162 ２五銀(24)   ( 0:01/00:01:21)
*#形勢[-198]▲４三歩打  △同金  ▲３一銀打  △同馬  ▲同角成  △同玉  
 163 ４三歩打     ( 0:01/00:01:22)
*#形勢[-201]△４三金  ▲３一銀打  △同馬  ▲同角成  △同玉  ▲３三歩打  △同金  ▲６四角打  △３二玉  ▲４二金打  △２二玉  
 164 ４三金(42)   ( 0:01/00:01:22)
*#形勢[49]▲３一銀打  △同馬  ▲同角成  △同玉  ▲３三歩打  △７二飛打  ▲３二銀打  △同飛  ▲６四角打  △２二玉  ▲３二歩成  △同玉  
 165 ３一銀打     ( 0:01/00:01:23)
*#形勢[18]△３一馬  ▲同角成  △同玉  ▲３三歩打  △７二飛打  ▲３二銀打  △同飛  ▲同歩成  △同玉  ▲８二飛打  △４二銀打  
 166 ３一馬(41)   ( 0:01/00:01:23)
*#形勢[-10]▲３一角成  △同玉  ▲３三歩打  △７二飛打  ▲３二銀打  △４二玉  ▲５四角打  △３三玉  ▲４三銀成  △２四玉  
 167 ３一角成(64) ( 0:01/00:01:24)
*#形勢[-12]△３一玉  ▲３三歩打  △７二飛打  ▲３二銀打  △４二玉  ▲５四角打  △３三玉  ▲４三銀成  △２四玉  ▲７二角成  △同歩  ▲１五金打  
 168 ３一玉(22)   ( 0:01/00:01:24)
*#形勢[-91]▲３三歩打  △同金  ▲８六角打  △３二玉  ▲４二金打  △２一玉  ▲３一銀打  △２二銀打  
 169 ３三歩打     ( 0:01/00:01:25)
*#形勢[91]△３三金  ▲７五角打  △２一玉  ▲３一金打  △１二玉  ▲２一銀打  △２二玉  ▲４二角成  △１九龍  
 170 ３三金(43)   ( 0:01/00:01:25)
*#形勢[112]▲９七角打  △３二玉  ▲３一金打  △２二玉  ▲２一金打  △１二玉  ▲２二銀打  △１九龍  
 171 ９七角打     ( 0:01/00:01:26)
*#形勢[-404]△４二銀打  ▲５三銀打  △同銀  ▲同角成  △４二銀打  ▲９七馬  △２八飛打  
 172 ４二銀打     ( 0:01/00:01:26)
*#形勢[-276]▲２二銀打  △同玉  ▲４二角成  △３二飛打  ▲同馬  △同金  ▲４一飛打  △４八龍  ▲４三金打  △同金  
 173 ２二銀打     ( 0:01/00:01:27)
*#形勢[-354]△２二玉  ▲４二角成  △３二飛打  ▲４一金打  △１四歩  ▲３一銀打  △１三玉  ▲３二馬  
 174 ２二玉(31)   ( 0:01/00:01:27)
*#形勢[-426]▲４二角成  △３二飛打  ▲４一金打  △４二飛  ▲同金  △３二金  ▲４三金打  △４二金  
 175 ４二角成(97) ( 0:01/00:01:28)
*#形勢[-236]△３二飛打  ▲４三銀打  △７九銀打  ▲３二銀成  △同金  ▲４一飛打  △８八銀成  ▲同玉  
 176 ３二飛打     ( 0:01/00:01:28)
*#形勢[-80]▲４一金打  △４二飛  ▲同金  △３一銀打  ▲同金  △同玉  ▲８二飛打  △４二角打  
 177 ４一金打     ( 0:01/00:01:29)
*#形勢[-505]△４二飛  ▲同金  △１四歩  ▲７三飛打  △６七角打  ▲３一銀打  △１三玉  ▲３三飛成  
 178 ４二飛(32)   ( 0:01/00:01:29)
*#形勢[-123]▲４二金  △３一銀打  ▲同金  △同玉  ▲９二飛打  △３二金打  ▲９三飛成  
 179 ４二金(41)   ( 0:01/00:01:30)
*#形勢[-545]△１四歩  ▲３一飛打  △７九角打  ▲２一金打  △１三玉  ▲３三飛成  △８八角成  ▲同玉  
 180 １四歩(13)   ( 0:01/00:01:30)
*#形勢[-334]▲３一飛打  △１九龍  ▲２一金打  △１三玉  ▲３三飛成  △９七香打  
 181 ３一飛打     ( 0:01/00:01:31)
*#形勢[99]△４八龍  ▲２一金打  △１三玉  ▲３三飛成  △７九銀打  ▲２四金打  
 182 ４八龍(49)   ( 0:01/00:01:31)
*#形勢[1783]▲２一金打  △１三玉  ▲３三飛成  △８八龍  ▲同玉  △７九銀打  ▲同玉  
 183 ２一金打     ( 0:01/00:01:32)
*#形勢[2151]△１三玉  ▲３三飛成  △８六桂打  ▲同歩  △８七銀打  ▲同玉  △５七龍  ▲７七銀打  △６九角打  ▲７八銀打  △１五角打  ▲６九銀  
 184 １三玉(22)   ( 0:01/00:01:32)
*#形勢[1149]▲３三飛成  △９七銀打  ▲同玉  △７五角打  ▲８六歩  △６六角  
 185 ３三飛成(31) ( 0:01/00:01:33)
*#形勢[2194]△８六桂打  ▲同歩  △８七銀打  ▲同玉  △６九角打  ▲７八銀打  △５七龍  ▲７七金  
 186 ８六桂打     ( 0:01/00:01:33)
*#形勢[1839]▲８六歩  △８七銀打  ▲同玉  △５七龍  ▲７七銀打  △６九角打  ▲７八銀打  △同角成  ▲同金  △６七角打  
 187 ８六歩(87)   ( 0:01/00:01:34)
*#形勢[2239]△８七銀打  ▲同玉  △５七龍  ▲７七銀打  △６九角打  ▲７八銀打  △１五角打  ▲２四香打  △同角  
 188 ８七銀打     ( 0:01/00:01:34)
*#形勢[2515]▲８七玉  △５七龍  ▲７七銀打  △６九角打  ▲７八銀打  △同角成  ▲同金  △９八銀打  ▲同玉  
 189 ８七玉(98)   ( 0:01/00:01:35)
*#形勢[3949]△６九角打  ▲７八銀打  △同角成  ▲同金  △９八銀打  ▲同香  △５七龍  ▲７六玉  △５八角打  ▲７五玉  △７六角成  ▲同銀  
 190 ６九角打     ( 0:01/00:01:35)
*#形勢[3193]▲７八銀打  △５七龍  ▲７七銀打  △７八角成  ▲同金  △７六銀打  ▲同玉  △５八角打  ▲７五玉  △８五角成  ▲同歩  
 191 ７八銀打     ( 0:01/00:01:36)
*#形勢[3899]△７八角成  ▲同金  △５七龍  ▲６七金打  △同龍  ▲同金  △６九角打  ▲７六玉  △１五歩  ▲２四銀打  △１四玉  ▲２三龍  
 192 ７八角成(69) ( 0:01/00:01:36)
*#形勢[4260]▲７八金  △同龍  ▲同玉  △４五角打  ▲５六銀  △６九銀打  ▲同玉  △５六角  ▲２二龍  △２四玉  ▲３三角打  
 193 ７八金(88)   ( 0:01/00:01:37)
*#形勢[4452]△７八龍  ▲同玉  △４五角打  ▲５六銀  △６九銀打  ▲同玉  △６八歩打  ▲同玉  △５八金打  ▲７七玉  △５六角  
 194 ７八龍(48)   ( 0:01/00:01:37)
*#形勢[4668]▲７八玉  △４五角打  ▲５六銀  △８七銀打  ▲同玉  △５四角  ▲６五角打  △同角  ▲同銀  △６九角打  ▲７七玉  △パス  
 195 ７八玉(87)   ( 0:01/00:01:38)
*#形勢[4774]△４五角打  ▲５六銀  △同角  ▲同歩  △６九銀打  ▲８七玉  △７八銀打  ▲７六玉  △８七銀  ▲６五玉  
 196 ４五角打     ( 0:01/00:01:38)
*#形勢[4759]▲５六銀  △同角  ▲同歩  △６九銀打  ▲８七玉  △７八銀打  ▲７六玉  △８七銀  ▲６五玉  △７六銀  ▲同玉  
 197 ５六銀(65)   ( 0:01/00:01:39)
*#形勢[5703]△８七金打  ▲同玉  △５四角  ▲９七玉  △２一角  ▲２二角打  △１二玉  ▲１三飛打  
 198 ８七金打     ( 0:01/00:01:39)
*#形勢[6667]▲８七玉  △９八銀打  ▲同玉  △５四角  ▲８八玉  △８七角成  ▲同玉  △８五歩  
 199 ８七玉(78)   ( 0:01/00:01:40)
*#形勢[8627]△５四角  ▲６五歩  △９八銀打  ▲同玉  △６五角  ▲同銀  △８五歩  
 200 ５四角(45)   ( 0:01/00:01:40)
*#形勢[9380]▲６五歩  △同角  ▲同銀  △７六銀打  ▲同玉  △８五歩  ▲１一金  △８六歩  ▲２二角打  
 201 ６五歩(66)   ( 0:01/00:01:41)
*#形勢[9657]△７六銀打  ▲同玉  △６五角  ▲同銀  △６四歩打  ▲２四金打  △１二玉  ▲２二飛打  
 202 ７六銀打     ( 0:01/00:01:41)
*#形勢[29993]▲７六玉  △６五角  ▲同銀  △６四歩打  ▲２四金打  △１二玉  ▲２二飛打  
 203 ７六玉(87)   ( 0:01/00:01:42)
 204 投了         ( 0:01/00:01:42)
まで203手で先手の勝ち

            ",
            'created_at' => new DateTime(),
            'updated_at' => new DateTime(),
        ]);
        
        /*DB::table('records')->insert([
            'user_id' => 3,
            'title' => 'ぴよ将棋レベル1同士対局',
            'first_player_name' => '',
            'second_player_name' => '',
            'first_player_strategy' => '',
            'second_player_strategy' => '',
            'first_player_castle' => '',
            'second_player_castle' => '',
            'remark' => '5分+5秒ルールでの対局',
            'record' => "",
            'created_at' => new DateTime(),
            'updated_at' => new DateTime(),
        ]);*/
    }
}
